[
    {
        "url": "https://eatthegains.com/cottage-cheese-pancakes/",
        "title": "Cottage cheese pancakes",
        "desc": "Cottage cheese pancakes are both quick and easy and taste delicious! Made in the blender with only cottage cheese, eggs, and oats for a light, fluffy, and healthy pancake recipe with 25g of protein per serving. The perfect well-balanced breakfast or snack.",
        "calories": 385.0,
        "protein": 24.6,
        "carbs": 41.7,
        "fat": 12.6
    },
    {
        "url": "https://eatthegains.com/chicken-hash/",
        "title": "Chicken hash",
        "desc": "Chicken hash is the ultimate hash recipe. Loaded with ground chicken, sweet potatoes, apple, veggies, and warming spices and ready in 45 minutes. Perfect for breakfast, lunch, or dinner and great for meal prep.",
        "calories": 384.0,
        "protein": 28.0,
        "carbs": 38.0,
        "fat": 13.5
    },
    {
        "url": "https://eatthegains.com/coffee-protein-smoothie/",
        "title": "Healthy coffee protein smoothie",
        "desc": "Healthy coffee protein smoothie with cold brew coffee, banana, protein powder, cashew butter, chia seeds, and cinnamon for the perfect on-the-go breakfast or post-workout protein shake! It packs protein, healthy fats, carbs, and fiber for a delicious balanced smoothie.",
        "calories": 426.0,
        "protein": 32.5,
        "carbs": 47.0,
        "fat": 14.6
    },
    {
        "url": "https://eatthegains.com/buffalo-chicken-breakfast-casserole/",
        "title": "Buffalo chicken breakfast casserole",
        "desc": "Buffalo chicken breakfast casserole made with eggs, chicken, buffalo sauce, and veggies. A perfect protein-packed and healthy breakfast and great for meal prep. Gluten-free, dairy-free, paleo, Whole30, and low-carb.",
        "calories": 271.0,
        "protein": 26.1,
        "carbs": 6.2,
        "fat": 15.1
    },
    {
        "url": "https://eatthegains.com/yogurt-bowl/",
        "title": "Chocolate peanut butter protein yogurt bowl",
        "desc": "Chocolate peanut butter protein yogurt bowl recipe makes an easy and healthy breakfast or snack! You only need a few ingredients and 5 minutes to make a healthy yogurt bowl packed with protein, healthy fat, and carbs. Top with toppings of choice to hit your macros!",
        "calories": 331.0,
        "protein": 40.5,
        "carbs": 19.0,
        "fat": 11.0
    },
    {
        "url": "https://eatthegains.com/apple-cinnamon-overnight-oats/",
        "title": "Apple cinnamon overnight oats",
        "desc": "Apple cinnamon overnight oats made with rolled oats, fresh apples, greek yogurt, and cinnamon. With just 5 minutes to prep, they make an easy, delicious, and protein-packed make-ahead breakfast or snack.",
        "calories": 468.0,
        "protein": 31.0,
        "carbs": 59.0,
        "fat": 12.6
    },
    {
        "url": "https://eatthegains.com/chicken-tomato-soup/",
        "title": "Chicken tomato soup",
        "desc": "Chicken tomato soup is a grown-up version of a childhood favorite. It’s loaded with shredded chicken breasts, veggies, and a creamy tomato soup base. Naturally lower in carb and perfect for meal prep. If wanting to add some more carbs, cook up some pasta to mix in while you eat it throughout the week.",
        "calories": 125.0,
        "protein": 14.5,
        "carbs": 7.5,
        "fat": 5.0
    },
    {
        "url": "https://eatthegains.com/chicken-taco-casserole/",
        "title": "Chicken taco casserole",
        "desc": "Chicken taco casserole is an easy dump-and-bake recipe. Simply mix the ingredients together ahead of time and bake for a hearty and healthy meal ready in 40 minutes. Or reheat it throughout the week. Just 337 calories per serving with 35 grams of protein.",
        "calories": 337.0,
        "protein": 35.5,
        "carbs": 27.0,
        "fat": 10.0
    },
    {
        "url": "https://eatthegains.com/chicken-and-broccoli-stir-fry/",
        "title": "Chicken and broccoli stir fry",
        "desc": "Chicken and broccoli stir fry has tons of chicken, broccoli, and a thick and sticky sauce to bring it all together. Easy to make, ready in 30 minutes, and only calls for 10 ingredients! Serve with white rice, brown rice, or cauliflower rice for more carbs.",
        "calories": 420.0,
        "protein": 37.0,
        "carbs": 30.0,
        "fat": 16.0
    },
    {
        "url": "https://eatthegains.com/chicken-quinoa-skillet/",
        "title": "Cheesy chicken quinoa skillet",
        "desc": "Cheesy chicken quinoa skillet with juicy chicken, quinoa, black beans, veggies, southwestern spices, and melted cheese. Made with 10 ingredients, packed with protein, complex carbs, veggies, and fiber for a hearty and satisfying meal the whole family will love.",
        "calories": 461.0,
        "protein": 39.5,
        "carbs": 48.0,
        "fat": 13.0
    },
    {
        "url": "https://eatthegains.com/jalapeno-popper-chicken-casserole/",
        "title": "Jalapeño popper chicken casserole",
        "desc": "Jalapeño popper chicken casserole combines your favorite aspects of jalapeños poppers and packs them into a warm and comforting healthy casserole recipe. Loaded with shredded chicken, jalapeños, and veggies, and lightened up with a mix of cream cheese and greek yogurt, and then topped with shredded cheese and crushed pretzels.",
        "calories": 330.0,
        "protein": 31.2,
        "carbs": 18.3,
        "fat": 15.2
    },
    {
        "url": "https://eatthegains.com/beef-and-cabbage-stir-fry/",
        "title": "Ground beef and cabbage stir fry",
        "desc": "Ground beef and cabbage stir fry comes together in one pan and is ready in 25 minutes for a quick and healthy dinner recipe. Packed with protein, veggies, and fiber and is also great for meal prep. It’s best served with rice for more carbs.",
        "calories": 414.0,
        "protein": 33.3,
        "carbs": 30.0,
        "fat": 18.6
    },
    {
        "url": "https://eatthegains.com/bison-chili/",
        "title": "Bison chili",
        "desc": "Bison chili is hearty and comforting and made with ground buffalo or ground beef, butternut squash, veggies, and warming spices making an easy and delicious healthy chili recipe that’s ready in 45 minutes. Make it for meal prep or an easy weeknight dinner.",
        "calories": 394.0,
        "protein": 35.0,
        "carbs": 29.0,
        "fat": 18.0
    },
    {
        "url": "https://eatthegains.com/paleo-beef-broccoli-stir-fry-whole30/",
        "title": "Beef and broccoli stir fry",
        "desc": "Beef and broccoli stir fry recipe is a flavor-packed dish made with fresh, whole ingredients. Easy to make and ready in 25 minutes for a healthy spin on a classic. Serve with your favorite carbs (we love rice!) to adjust to your goals.",
        "calories": 217.0,
        "protein": 18.0,
        "carbs": 13.0,
        "fat": 10.0
    },
    {
        "url": "https://eatthegains.com/philly-cheesesteak-skillet/",
        "title": "Philly cheesesteak skillet",
        "desc": "Philly cheesesteak skillet combines tender steak, sautéed peppers, onions, mushrooms, and melted cheese in one pan for a healthy, low-carb, and gluten-free meal ready in 25 minutes. Serve on a roll to up your carbs if needed!",
        "calories": 364.0,
        "protein": 33.7,
        "carbs": 8.7,
        "fat": 22.6
    },
    {
        "url": "https://eatthegains.com/steak-and-sweet-potato-skillet/",
        "title": "Steak and sweet potato skillet",
        "desc": "Steak and sweet potato skillet made in just 25 minutes with just 10 simple ingredients. Tossed in a smokey chipotle sauce to bring it all together for an easy and healthy one-pan dinner recipe. It’s packed with protein, complex carbs, and veggies.",
        "calories": 478.0,
        "protein": 41.1,
        "carbs": 44.2,
        "fat": 16.4
    },
    {
        "url": "https://eatthegains.com/ground-turkey-sweet-potato-skillet/",
        "title": "Ground turkey sweet potato skillet",
        "desc": "Ground turkey sweet potato skillet combines turkey, sweet potato, veggies, and cheese to make a delicious dish packed with protein, carbs, and fiber. It’s made in one pan and saves great throughout the week by simply reheating on the stove or in the microwave. High protein and easily made dairy-free.",
        "calories": 418.0,
        "protein": 33.0,
        "carbs": 45.0,
        "fat": 13.0
    },
    {
        "url": "https://eatthegains.com/turkey-butternut-squash-soup-paleo-whole30/",
        "title": "Leftover turkey soup",
        "desc": "Leftover turkey soup is a great way to use up cooked turkey or chicken. Packed with carrots, celery, onion, kale, and butternut squash for a comforting and healthy turkey soup recipe ready in 45 minutes. Gluten-free and high protein.",
        "calories": 171.0,
        "protein": 17.0,
        "carbs": 16.3,
        "fat": 4.4
    },
    {
        "url": "https://eatthegains.com/healthy-turkey-taco-skillet/",
        "title": "Turkey taco skillet",
        "desc": "Turkey taco skillet combines your favorite aspects of tacos and packs them into a healthy turkey recipe. Loaded with ground turkey, rice, beans, peppers, tomatoes, and spices, it makes a delicious and hearty one-pan meal ready in 35 minutes!",
        "calories": 527.0,
        "protein": 32.0,
        "carbs": 68.0,
        "fat": 14.2
    },
    {
        "url": "https://eatthegains.com/shrimp-rice-noodles/",
        "title": "Shrimp rice noodles",
        "desc": "Shrimp rice noodles combine rice noodles, shrimp, veggies, and spices with a creamy Thai-inspired peanut sauce. It comes together in 30 minutes with just 10 ingredients and is perfect for an easy and healthy dinner recipe. Gluten-free and dairy-free.",
        "calories": 529.0,
        "protein": 33.0,
        "carbs": 66.0,
        "fat": 14.0
    },
    {
        "url": "https://eatthegains.com/fish-taco-bowl/",
        "title": "Fish taco bowls",
        "desc": "Fish taco bowls have blackened fish, shredded cabbage, pineapple avocado salsa, and fish taco sauce – all topped over cauliflower rice or white rice to make an easy and healthy bowl meal.",
        "calories": 521.0,
        "protein": 33.2,
        "carbs": 57.4,
        "fat": 18.8
    },
    {
        "url": "https://eatthegains.com/salmon-poke-bowl/",
        "title": "Salmon poke bowls",
        "desc": "Salmon poke bowls filled with fresh salmon, rice, veggies, mango, avocado, your favorite sushi additions, and topped with spicy mayo. These homemade poke bowls are fresh and bright, loaded with protein, carbs, and healthy fats, and make a quick and easy meal customizable to your liking. A taste of Hawaii in your own house!",
        "calories": 578.0,
        "protein": 30.0,
        "carbs": 55.0,
        "fat": 26.4
    },
    {
        "url": "https://eatthegains.com/one-pan-whole30-shrimp-fajitas/",
        "title": "Shrimp fajitas",
        "desc": "Shrimp fajitas make an easy restaurant-inspired meal at home. All you need is one pan and 30 minutes for a healthy and delicious meal. Serve with rice, beans, lettuce, tomato, avocado, or tortillas for the full experience and to easily adjust for your goals!",
        "calories": 268.0,
        "protein": 34.3,
        "carbs": 17.4,
        "fat": 8.4
    },
    {
        "url": "https://eatthegains.com/asparagus-pasta-with-creamy-lemon-feta-sauce/",
        "title": "Lemon asparagus pasta",
        "desc": "Lemon asparagus pasta combines pasta and asparagus with a creamy lemon feta sauce made from greek yogurt, feta, lemon, and herbs. It comes together in 20 minutes, has 20 grams of protein, and is so delicious!",
        "calories": 399.0,
        "protein": 20.0,
        "carbs": 46.0,
        "fat": 15.0
    },
    {
        "url": "https://eatthegains.com/cottage-cheese-bowl/",
        "title": "Cottage cheese bowls 2 ways",
        "desc": "Cottage cheese bowls 2 ways – one sweet and one savory. Makes a delicious, protein-packed, gluten-free, and healthy breakfast, lunch, or snack. Easily customizable by changing out toppings!",
        "calories": 328.0,
        "protein": 30.0,
        "carbs": 17.0,
        "fat": 15.6
    },
    {
        "url": "https://eatthegains.com/protein-pancakes/",
        "title": "Healthy high protein pancakes",
        "desc": "Healthy high protein pancakes with protein powder, oats, banana, eggs, milk, and spices. Light and fluffy, easy to make, and packed protein, complex carbs, and fiber for a well-high-protein breakfast. Customize with your own toppings!",
        "calories": 514.0,
        "protein": 36.7,
        "carbs": 63.0,
        "fat": 14.0
    },
    {
        "url": "https://eatthegains.com/creamy-vegan-pasta/",
        "title": "Vegan pasta with vegetables",
        "desc": "Vegan pasta with vegetables is made with 10 ingredients and is ready in 30 minutes. And it packs 17 grams of plant-based protein, fiber, and healthy fats for a well-balanced meal. It will be your new go-to plant-based meal for an easy and comforting meal that is perfect for meal prep.",
        "calories": 495.0,
        "protein": 17.0,
        "carbs": 62.0,
        "fat": 21.0
    },
    {
        "url": "https://eatthegains.com/coconut-curry-lentil-soup/",
        "title": "Coconut curry lentil soup",
        "desc": "Coconut curry lentil soup is full of veggies, lentils, coconut milk, and curry spices for a flavor-packed vegan lentil soup recipe. It comes together in one pan in 35 minutes, has 22 grams of protein in 2 cups, and makes a healthy well-balanced meal.",
        "calories": 271.0,
        "protein": 11.0,
        "carbs": 33.0,
        "fat": 10.6
    },
    {
        "url": "https://eatthegains.com/chocolate-peanut-butter-overnight-oats/",
        "title": "Chocolate peanut butter overnight oats",
        "desc": "Chocolate peanut butter overnight oats take 5 minutes to make, are full of complex carbs, 19 grams of plant-based protein, fiber, and healthy fats, and are absolutely delicious.",
        "calories": 547.0,
        "protein": 32.5,
        "carbs": 56.6,
        "fat": 24.0
    },
    {
        "url": "https://eatthegains.com/meal-prep-smoked-salmon-breakfast-bowl-paleo-whole30/",
        "title": "Smoked Salmon Breakfast Bowl",
        "desc": "Smoked Salmon Breakfast Bowl features smoked salmon, breakfast potatoes, greens, a quick salad, and perfect jammy eggs (although cook to your preference)! Paleo and Whole30 and also great for meal prep.",
        "calories": 473.0,
        "protein": 26.5,
        "carbs": 45.5,
        "fat": 22.0
    },
    {
        "url": "https://eatthegains.com/sweetgreen-harvest-bowl/",
        "title": "Copycat Sweetgreen Harvest Bowl",
        "desc": "Copycat Sweetgreen Harvest Bowl is made with marinated chicken, roasted sweet potato, brussel sprouts, apples, pecans, goat cheese, and a creamy balsamic dressing. It makes a delicious flavor-packed grain bowl that is perfect for a healthy lunch or dinner and a great option for meal prep.",
        "calories": 641.0,
        "protein": 36.5,
        "carbs": 64.0,
        "fat": 29.0
    },
    {
        "url": "https://eatthegains.com/spaghetti-squash-casserole/",
        "title": "Chili spaghetti squash casserole",
        "desc": "Chili spaghetti squash casserole combines ground beef, black beans, fire-roasted tomatoes, bell peppers, onions, spices, and cheese into one delicious and comforting baked spaghetti squash casserole. Makes 8 servings, saves great throughout the week, and one serving has 31 grams of protein!",
        "calories": 344.0,
        "protein": 31.6,
        "carbs": 23.0,
        "fat": 14.2
    },
    {
        "url": "https://eatthegains.com/chicken-cabbage-salad/",
        "title": "Chicken cabbage salad",
        "desc": "Chicken cabbage salad is a light and flavorful Vietnamese-inspired salad with cabbage, chicken, peppers, carrots, snap peas, cashews, basil, and a refreshing dressing. Makes a ton and is perfect for meal prep (just leave off the dressing until you serve).",
        "calories": 312.0,
        "protein": 32.0,
        "carbs": 20.0,
        "fat": 11.4
    },
    {
        "url": "https://eatthegains.com/chicken-burrito-bowls/",
        "title": "Chicken Burrito Bowl",
        "desc": "Chicken Burrito Bowl makes for a fresh, inexpensive, and healthy dish for an easy meal or meal prep. Loaded with shredded chicken, fajita veggies, cilantro lime cauliflower rice (or white rice), lettuce, tomatoes, and guacamole. Makes 5 servings, ready in under an hour, perfect for lunch or dinner! Paleo and Whole30 friendly.",
        "calories": 441.0,
        "protein": 39.0,
        "carbs": 34.0,
        "fat": 17.0
    }
]