{
    "aLYu2rzcJOghvIJl21t-dA": [
        "Curry Do is a must try place for fans of Japanese curry.  Both the chicken katsu as well as the pork belly are amazing.  I suggest giving this place a try...",
        "Pretty good \n\nTried out this new spot for an event and was pleasantly surprised. With the slew of new curry places I'm glad this place was not going the...",
        "I am frankly shocked by these reviews because while the sauce is decent, they scrimp so much on the protein that it's laughable.  Inflation and all, it's..."
    ],
    "NzZGeOg5lbfG4ntkb2mIlw": [
        "Good food, great service, great  ambiance. Artichoke Fondue is a must have. New York Steak and Gochujang Fried Chicken were also very good.",
        "Absolutely amazing. Will be coming back soon. Love the outdoor ambiance with the plants, decor, and heaters. The service was amazing. Roro our server had...",
        "Food was good but for the prices charged it's not worth it especially considering how small the portion sizes are.\n\nCame here for dinner one night and sat..."
    ],
    "RWAugaLWYZpoO2iUDZ40Xw": [
        "Seven Grams is by far one of the best restaurants we've tried in awhile. Everything we had here was so good, but the highlight of the meal was definitely...",
        "Wow! What a pleasant surprise! \n\nWe originally planned on going to a different dumpling restaurant. However, we decided to stay local and wanted to check...",
        "Got 4 orders of soup dumplings here -- 2 each of the shrimp/pork and spicy pork. \n\nPros: the dumplings were easy to peel off from the steamer paper without..."
    ],
    "jUy-UGQfTMx7TxFVNKU7RA": [
        "Ordered here during our stay at the Viv from Door Dash. \n\nQuick delivery service \nKaraage \nOriginal cheesecake \nChasu fried rice \nKatsu curry \n\nIt was so...",
        "Getting takoyaki delivered is usually a gamble because you'll be dealing with potential sog or rubbery texture from the filling. Luckily for me, Orimori is...",
        "Ordered some late night takeout and I was surprised by how decent the ramen was here considering it's a concept restaurant. \n\nMy order was ready within 30..."
    ],
    "S8tV-EFYR7fl0sYBEiH6Mw": [
        "Delicious food! Quaint, petite, and casual indoor seating. Lots of outdoor patio space with space heaters for those cooler evening nights! \n\nDo not hesitate...",
        "Worth it.\n\nWhat a charming little bar/restaurant. It was a casual friday night and our curiosity was itching. This time, we went to Downtown Santa Ana for...",
        "This place was surprisingly so small in downtown Santa Ana but good thing it was a weekday so we didn't need to wait to sit at the bar. \n\nFood was very..."
    ],
    "0rSsNKGe2wDJz1NAwdzpgA": [
        "Tucked away in a little corner. When we went, the Sandwich of the month was Ramen Grilled Cheese Sandwich.  Delicious and though you may not opt to eat...",
        "Look no further, MUST TRY SPOT. Stop typing on the search bar for a good sandwich place! This is a go-to spot!! \n\nI was delighted with this sandwich place....",
        "My mom and I were looking for a light lunch spot after visiting Bowers museum and found this place on Yelp. \n\nI got the chicken pesto sandwich and she got a..."
    ],
    "i9w8MOdJBgQO09EN7KOoaA": [
        "Love this place so much! My wife and I would go to their AZ locations on trips to see family and we would go everyday for lunch. When we heard they were...",
        "Love this place! The food and wine is so different and fun to try. Nicolina, Tanner, Julien, and Carlos are just wonderful humans that give wonderful...",
        "Tried for the first time after being recommended from a friend and was not disappointed!!! Their bruschetta boards are absolutely to die for, being able to..."
    ],
    "8d3gXfkt3DE81qRxranyUA": [
        "My party and I ordered the shrimp pho, chicken wing fried rice, and the filet mignon cajun garlic noodles. \n\nThe shrimp pho was typical pho, nothing special...",
        "Amazing food. Very unique style . Would love to go back for more. The wings were great. Need to try more. Ok",
        "Waiting time was 60 minutes so we ordered take out. Phở tasted delicious.\nBeef Rib Pho & Fillet Mignon Pho"
    ],
    "ObCj8Y3KAdk4bgc8oSxNcA": [
        "The vibe here is amazing ! We were in town and decided to try something new, more like a local restaurant. We walked in and the scenery is super nice. It...",
        "This was such a great spot to host our private event for an alumni happy hour. Susan was very helpful with the booking process, and the entire staff on-site...",
        "I had the pleasure of dining here on a super busy night, and I was lucky enough to have Oscar as my server. Despite the chaos, Oscar was the epitome of..."
    ],
    "vJcs7dCvE1SGfFhr3UlTUA": [
        "During the pandemic, Shari Nori was a pop up and to fulfil my sushi cravings, I would order from them ahead of time and pick up at 4th street market.\n\nSo I...",
        "The service was really great. It did take a long time for my food to be ready but that's because they are back there trying to prepare everything fresh and...",
        "Have bookmarked this for quite some time so I am happy that I finally got to try ShariNori. \n\nOrdered the ShariNori special roll with crispy rice, spicy..."
    ],
    "J4LJdSPgUs9HcJuqnSADOQ": [
        "I don't usually write reviews but Lunch Bang deserves the kudos. The place is very lowkey, located in a small but vacant strip mall. All concrete inside...",
        "No frills, hole-in-the-wall lunch spot serving up a variety of Asian dishes and some mean burgers. The family that runs it is Korean so you can trust the...",
        "Mom & Pop & Son joint.\n\nKiller lunch tray specials.\n\nGreat for carry out and they put a cool miniature skillet with baked mac and cheese on your lunch..."
    ],
    "UaMcehe_Z39MHQsrWbKQ9w": [
        "I've been to a dozen hotpot places and this is my FAV \n\nFirst of all, great quality of food for the price. Their angus beef is soooo good. Their skewers are...",
        "Fun atmosphere! Broths [mushroom + tum yum] and quality of meats/veggies were delish! \n\nWe spent $70+ for two ppl and ended up having two soup containers to...",
        "Malubianbian Hotpot is such a fun place for hot pot featuring skewers!  \n\nThis place reminds me of Haidilao, but with emphasis on skewer hot pot.  The..."
    ],
    "hIliM0HbkN9EZESaG6voeg": [
        "Great food, consistently. Great atmosphere. \nInteresting and diverse menu. Usually get sat within 30 minutes.",
        "Finally, I recently checked out Nếp Café by Kei Concepts, #3 in my journey to try all the Kei Concept restaurants. \n\nVibe: Nếp Café has a cozy and inviting...",
        "// Summary\nA very popular modern Vietnamese restaurant that is worth a try - but make sure you reserve your spot in advance!\n\n// Experience\nCame here with a..."
    ],
    "Iz9C-sE2XNQgfZqut_TOWQ": [
        "The restaurant has a very nice vibe. We sat in the patio during lunch time. The Toro Uni Bowl was so delicious. I loved the little gold flakes. We ordered...",
        "Came here for my birthday tonight and could not have asked for a better experience. We got the chef's choice sashimi assortment as our main dish and some...",
        "I was passing through Irvine on my way back home to San Diego and I'm so glad I found Izakaya Osen. I booked a reservation for their opening at 11:30 am on..."
    ],
    "lbidwAxfPHpIcW8I7UUIgA": [
        "I am so mad at myself for not finding this gem of a spot sooner, because I'm already dying to go back after my first visit!!! If you're looking for quality...",
        "Food 5/5 \nDelicious and good portions for the price! My boyfriend and I both ordered the special and although the food took a little longer to come out we...",
        "I recently visited Tanakaya and was blown away by the delicious soba noodles and tonkatsu. I particularly enjoyed trying the soba sampler because each..."
    ],
    "Xqkmfdq0vXBQ8aQ58nA1tQ": [
        "We went here for lunch\nLove that we get to eat both hainan and crispy chicken at the same time, over chicken rice\nIt was so good with their ginger dipping...",
        "It was our second time visiting The Chicken Rice and the 1st time was with some friends who highly recommended the place.  We had such a good experience...",
        "Great flavor! I think a lot of people don't appreciate the simplicity of hainan chicken. It's steamed in a way that preserves the core flavor and takes in..."
    ],
    "kW2aa2WnKCwT28lZk2sCOA": [
        "I've been on a mission to find the most authentic and vibrant culinary experiences in Southern California, and let me tell you, Trust in Santa Ana has...",
        "There are not enough stars for this establishment. My wife and I have been coming here for 9+ years, prior it was called Playground 2.0 and run by Jason...",
        "One of my new favorite dining experiences! \n\nI've been wanting to come here ever since they were Playground 2.0 but wasn't sure if it'd be worth the cost...."
    ],
    "K-7MQtBEGOmEGGi0bDfC1w": [
        "Some friends and I choose a new restaurant every other week and then meet up to enjoy good food and company.  This past week, we tried out Chaak Kitchen,...",
        "We came on a Thursday night and it was packed! We ended up sitting at the bar and the service was very friendly and helpful. I ordered the pepino margarita...",
        "Came to CHAAK Kitchen as I was told this restaurant received a Michelin star, so I wanted to see what the hype was about. \n\nStaff are are friendly and..."
    ],
    "SJw92K29eIGglPMsTd1plg": [
        "What a great place! The food was excellent and the service, friendly and efficient. The rotisserie chicken was very good! Great chips and salsa as well. And...",
        "Ambiance is beyond perfect. Service was phenomenal and fabulous. But the food omfg sooooo good and tasty. The burritos remind me of the burritos that my...",
        "Great customer service! I ordered the chorizo burrito, and it was good! I liked how it came with bite size pieces of chorizo. The smoky tomato salsa paired..."
    ],
    "zNGW6fHMh33GxAQi7DUwcw": [
        "A few months ago, I visited this restaurant for the first time and was impressed with the food quality, service, and recommendations. Recently, I returned...",
        "I've been raving about this place to my partner for having really good food, but unfortunately, the one time he takes me it is very underwhelming...\n\nI've...",
        "Authentic Italian restaurant in Tustin! \nOrdered the antipasto and calamari fritti for appetizers they were 10/10 good! Especially the fried calamari!!!..."
    ],
    "dBSlJx9gNtomml0ozHNKyQ": [
        "My brother says it the best burger in the OC!\nI say you'll never go wrong eating here!\nThe burgers are made with good quality ingredients and there is a...",
        "\"OH! MY! GOD!\"  There really isn't much else to say, really... oh yea, \"SOOOOO GOOOOOOD!!\"\nTheir burgers are fresh cooked to order, the Bun is soft, a pinch...",
        "Zowie!! This place is awesome! My hubby and I went for the first time Saturday. There are all kinds of burgers to choose from. I went for the Hermanator..."
    ],
    "4P2iknlrn4T730fXOuHRug": [
        "High quality, reasonably priced Mexican food. Both the taco station people and the guy that runs the store are very kind and professional. Really worth a stop!",
        "I can always count on Yelp and my fellow Elites to guide me to the right places. As an office manager, I am always looking for new catering options. I found...",
        "05/03/2023\n\nHubby was craving carne asada fries so I searched the area and saw The Taco Station bookmarked in my Yelp. We headed here before picking up our..."
    ],
    "vK9PhezqXQgVdz-R6207Tg": [
        "I never leave reviews but this place honestly deserved one, as soon as we walked in we got greeted by this nice gentleman and got seated and got asked for...",
        "The best hamburger, sweet potatoes and fries, every thing was so god.  And the service and attention of Jessica was so nice",
        "Food is always amazing doesn't need any condiments, the burgers has that charbroiled taste ! The also have this homemade potato salad that's honestly the..."
    ],
    "yj1giJ952W1VimR8gMykhw": [
        "Food was amazing. Ordered the Swai tacos and Aguachile. Aguachile was spicy. The pineapple margarita was real good too! The salsa for the chips was real...",
        "What We Got //\nCame for brunch + watch the soccer game on a Sunday morning. The menu is not big, but all the dishes did sound delicious. We ended up going...",
        "Came here with my coworker after a long day of work .... And oh my my .... The food is absolutely yummy. I really appreciate the free chips and salsa as you..."
    ],
    "14ZqnmKpptBX3rzHVimAtA": [
        "Had a delicious lunch here recently! CHD is a new spot located inside the food court at the large HMart location in North Park, Irvine. \n\nWhile they...",
        "The pan-friend Korean dumplings from CHD are good. I tried the 10 Mandu Sampler ($14) which comes with two of each: beef, pork, shrimp, jalapeño, and...",
        "This is a hidden gem in Irvine! \n\nCHD Mandu sits inside a food court at the North Park Irvine HMart. \n\nHave you had Rose Tteokbokki? This is a MUST!! I am..."
    ],
    "0iSAKpcVCCJXMPdfX_D1zQ": [
        "As always, I was craving some good pizza and salad and thanks to fellow Yelpers, I discovered this hidden gem! It's literally in a business complex like...",
        "I was really impressed with The Parlor!\n\nStopped by for a quick lunch and got the CACIO E PEPE. The pasta was fresh and perfectly al dente. The cheese ratio...",
        "An interesting neighborhood gem nestled inside a business area. The industrial aesthetics and open atmosphere is super inviting...Super unassuming. Net..."
    ],
    "hXz1kntWDwj2TKssW3Jyyg": [
        "Great service and good food. Very busy but got seated pretty quickly. If you are craving good Japanese food, this is the place to be.",
        "One of my favorite restaurants in OC!\n\nUpon arriving, if you get there late on the weekends you will be waiting awhile. even during the week sometimes. but...",
        "We ordered the yellow tail plate, oysters, monk fish and different types of skewers to try.\n\nBeef tongue and chicken wings were both very tasty.\n\nService..."
    ],
    "EjuethqTHCA76eW43u7hpQ": [
        "I bookmarked Nguyen's Kitchen a while ago because the food looked good and I finally had a chance to stop by while on a road trip. I came here at around...",
        "Bustling and busy even in the evening, but the cashier was on top of the line and we didn't wait long at all for our to-go order.\n\nBanh mi was good and...",
        "I looove me a good banh mi and this was DEF a good one!! It was my first time having the pickled radish and carrots shredded and I think I like them better..."
    ],
    "2OO0uUH_lPstoKvMiuEt8w": [
        "Oh man, I love this place! It's a busy place in the evening so be prepared for a bit of a wait - there's a sign in sheet. But their vegan mazemen is...",
        "Amazing vegan ramen! Everyone who works there is super kind and polite too, I love coming during their happy hour and getting their fries as well",
        "Run don't walk to mogu mogu-- the most well thought out food experience i've ever had. Look. After you've consumed the most luscious noodles of your life,..."
    ],
    "q_Vru8PoYVmuRffx-2sQRw": [
        "I had to come back to update my review because this place just seems to get better every time I eat it!  I found them through DoorDash and have had their...",
        "I enjoyed my TJ style tacos here.\nI was looking for a taco shop and I've always seen this little stand in Santa Ana and for some reason I never stopped at...",
        "Located off a pretty busy intersection & right between the Chevron gas station and a Lavanderia business. Parking can be a bit tough to find for I think..."
    ],
    "6LfE1K5UBcLuaO8CaWbZow": [
        "reminded me of home! i'm from the midwest and was so excited to bring friends out here to get a taste of comfort food!\n\nwe ended up doing family style and...",
        "I'm so happy that Gus's has a location in Orange County! Their fried chicken is great. I'm also a huge fan of their friend okra. It's crunchy and crispy and...",
        "Wow wow wow like usually \nI love it guys , it's so delicious crispy chicken  \nso yummy , the service was great  \nThank you so much  \nPlease open in Irvine plz"
    ],
    "VeuNwuYxvOB3_LTwtHzfkg": [
        "I want to absolutely recommend the pork belly rice bowl. Amazing flavors, the pork belly was not just all fat, it actually had meat, and it was a good...",
        "Yet another restaurant that I get to check off of my Yelp collections list! Visited on a Friday afternoon and service was friendly and timely. I ordered...",
        "What can I say about toast that can't already be backed by it's amazing product.\n\nWe were looking for a new spot away from our norm.\n\nDid a lil bit of..."
    ],
    "ZsNsQchXY0SG5puyDSnqgA": [
        "hole in the wall authentic japanese restaurant~\n\nfound this hidden gem on a week day 30 min before closing and they were gracious enough to serve us!! we...",
        "We went on a Friday night and they had a full waitlist. **tip for next time: call ahead to res** I think we got lucky that we walked up when we did coz at...",
        "Honda-ya was a go-to but I really love this place. It's tiny and hard to get walk-in seating unless you are a party of two and come in at opening. We did..."
    ],
    "XrWUW9dj5AjPFfjQoD8pRA": [
        "Come in here you need to come and hour before you want to eat because there's always a lot of people waiting. The good thing about this place is that they...",
        "Came here on Saturday 5/20/23. The food and service was great. Only reason for a 2/5 star review is because it seems like the seating was according to race....",
        "Went here for lunch on a Sunday afternoon with some friends and were pleasantly surprised that there was no wait. We were seated quickly and bread and..."
    ],
    "vm8Lyg1mn2VUbwrYU8o3hg": [
        "Absolutely recommend. Service AMAZING. we ordered 8pce dumpling set, Manager noticed us counting/checking and came without us having to say anything  he...",
        "The food here was great! I took a friend and it was the best xiao long bao she's ever had. We ordered the baby cabbage and friend rice with pork as well as...",
        "Came here on a Tuesday, and the place was packed. We sat at the bar and it was really nice. The service was good, and the bartender was friendly. We ordered..."
    ],
    "rv6M9cyWZJdgb1YWg39ztQ": [
        "Chew me exceeded my expectations from the moment I walked in! The highlight of my meal was definitely the kimchi stew! What I appreciated most about this...",
        "This restaurant just opened recently around one month or so. The server/owner was really nice and took her time to explain the menu to us. They were working...",
        "SERVICE: It was my first time being here with my partner and upon entering the restaurant we were greeted very kindly and joyfully by the lady at the..."
    ],
    "kUIS_wC480NV3JkZel1v9Q": [
        "Great food and always consistent. Good prices too. Salmon plate and fillet mignon bowl are my go to",
        "Another mandatory Yelp review for this place.  Not only is the food fantastic, but the staff is welcoming, friendly, helpful and creates a great dining...",
        "Dropped in this place after landing and leaving airport. \n\nI was craving fish but once I got inside I saw Mediterranean and pivoted. I got the beef &..."
    ],
    "8atnaET6Gdh9zRQsYIAMGw": [
        "Frankly one of the best breakfast burritos I have ever had, I still dream about that burrito... \n\nWe ordered to-go on a weekday morning and sat in the...",
        "My boyfriend and I came for the first time today to try the surf and turf burrito and California burrito. Both were so delicious and full of flavor....",
        "Wifey and I were in the area and looking for a place for breakfast burritos. Wow!  Super fresh eggs cooked perfectly. Home made green salsa with habanero...."
    ],
    "NVB2X8t5Rie8S5AnzOnWJg": [
        "I was so excited to try this place , yet left hungry and embarrassed. It was my choice and my husband wanted to go somewhere else so when our grandsons were...",
        "Chris was our server and he was so sweet and attentive!! Everything we got was amazing! Always have a great time when I come here.",
        "I am a big lover of Italian food so me and my fiance are always on the search for a place that has good pasta, but also good other stuff and North Italia..."
    ],
    "b9oj7Sn3Zlxh_ONGsysMvQ": [
        "Came across Luscious dumplings by accident and was blown away by the quality and taste of the food! Each dumpling was bursting with juicy filling, and the...",
        "Found this place while on one of my business trips and I absolutely love it!!! I got the angus beef noodle soup and soup dumplings and they both were so...",
        "WOW LOVELY PLACE AND THE FOOD IS ABSOLUTELY GREAT! Troy is also a great cashier very respectful and his service is amazing! love the place definitely..."
    ],
    "wtvyKJO-rdcTdz-Ys__7UA": [
        "Just had lunch here with my kid and everything was so delicious! \n\nHe had the Steak n' Eggs n and I had the Fried Chicken Po'Boy and we loved all of it. The...",
        "I stopped in here for lunch with a co-worker and neither of us had been here before. We were so impressed! The vibe is urban and bright. There's not a lot...",
        "The location for this little brunch and cafe spot was very out of place in my opinion, but the food was quite good. Got to try this place around February..."
    ],
    "h3jgsILDZSyrXaZOkTPJBg": [
        "We found this gem in an unexpected strip mall. \nThe restaurant is small and crowded, but the wait wasn't too long. Casual vibe. \nPortions were huge. We had...",
        "Came for a quick lunch with a friend.  We shared the pineapple fried rice with shrimp and the chicken pad woon sen. \n\nThe pineapple fried rice was really...",
        "Mhmm that was delicious! \n\nSiam station is a fast causal restaurant. They are busy but not so busy that you have to wait to be seated. They have both indoor..."
    ],
    "u4ccY8IdKsob8azU3S2L3w": [
        "Finally, a place to enjoy some delicious Korean Food at an excellent price.  I have been to many Korean Places and it's sometimes overwhelming after a great...",
        "Great food and friendly service. There are also lunch sets and drinks that office workers will like. I enjoyed it at all.",
        "Delicious good comfort foods. It was exactly what I craved, and they really hit the spot. I had their spaghetti with meat sauce pasta and spicy pork bulgogi..."
    ],
    "FdlzwOrpeP-ZNdE5S86HJA": [
        "I recently ordered from this eatery and was pleasantly surprised by the flavors. I ordered the crab fried rice which seems to be one of their more popular...",
        "Finally got to try the tom yum shrimp fried rice and love, love, love it. \n\nWould have been perfect if I can choose the level of spiciness but that's not a...",
        "This place is tucked away in the food hall in Santa Ana, food comes out super fast and probably the best bang for your buck thai food  in the area.  Not..."
    ],
    "uci0HmcMzRvbtV7HZgzYEQ": [
        "I was staying in downtown Santa Ana and this place was right below me. It's in a food hall with several other options to choose from. There's also an area...",
        "Tried the Katsu plate, very flavorless. The chicken was medium rare and with extra fat. I thought it was going to be nice white chicken breast. \nWebsite...",
        "I recommend this business. I came here with my girlfriend on a Sunday around lunch time. Finding street parking was a bit difficult but thankfully I wasn't..."
    ],
    "lmvK_3_c58AR_GcBCHRLuA": [
        "This spot has been on my rotation for a while after a friends (and Yelp's) recommendation.  If you look in my reviews, you will know that my favorite place...",
        "A TASTE OF THE OLD WEST\n\nNestled deep within the endless suburbs of Orange County lies a little breakfast spot known as the Cowgirls Cafe. Or is it the...",
        "Had breakfast at Cowgirl's today and it was okay.  Not as good as the first visit, but satisfying all along.  We had the vegetarian omelet and the corn beef..."
    ],
    "Ewuh4AQEbjGMR0r8lVtrXw": [
        "If I had to eat at one restaurant for the rest of my life, it would definitely be Hanuman Thai Eastery. This place holds a special place in my heart. Here...",
        "This place can get busy. Had no idea. What was estimated as an hour wait turned into 1.5 hrs. Yikes. The place is rather small, a few tables inside and some...",
        "We have been there twice. First time, waited 45 mins to sit outside. Food was okayish. Went second time to mainly try their mango sticky rice. But they did..."
    ],
    "MNvBM6N8zeldlSRUuP4nKw": [
        "Santa Ana's best Burger. \n\nDid you know that the character minimum is 85 per review on Yelp?",
        "I've been following the team from Hammer Burger since they started. Hopscotching from brewery to brewery in Orange County, their quality never disappointed,...",
        "Hammer burger is a great addition to downtown Santa Ana. \nMy friend and I came here for dinner last Friday night. We were expecting a long wait since I know..."
    ],
    "PkZoD4-sz_gmNQ1yPCVdgQ": [
        "Friends and I saw this place on Yelp so we decided to give it a try.\n\nThe food was excellent, the atmosphere was lowkey for a Sunday afternoon and the...",
        "Parking: \nA bit awkward of an entrance and exit, but enough parking considering it wasn't busy at the time. \n\nService:\nFast service, friendly staff\n\nQuality...",
        "Amazing food with what Mexicans call Sazón.\n\nEveryone longs for their childhoods' home cooking, but sometimes you get a place that is just that good. This..."
    ],
    "mKqueTx2dB8K2IoA0-TWdQ": [
        "I highly recommend this spot. Been here about 7 times in the past two weeks. The food is really high quality and especially the vegetables. Nothing beats...",
        "Great place and great service. The Food was awesome definitely coming back. The ambiance was soothing and pleasant.",
        "great service front register was super cool guy! food is amazing  store is also clean !"
    ],
    "EKqcaKj-MWbZe6eHHTSEhw": [
        "I came in with my friends on opening day and the food and service were just great. I had the egg sandwich, which contains scramble eggs, bacon, chipotle...",
        "Amazing authentic Mexican food !!!! The Chile Verde was incredible as well as the horchata latte. The latte was one of the best I've tasted ! For coffee...",
        "Such a beautiful and unique location! The food here is amazing! The ingredients taste fresh and an authentic flavor. I love their drinks here! The mimosas..."
    ],
    "-0Xd3c6-H-vC5mUWw2P5yg": [
        "My friend has booked these guys multiple times now and the dudes running the show here never fail. If you have the chance to, don't go to Benihana or the...",
        "I hosted a backyard teppanyaki / Super Bowl party yesterday and The Unruly Grill provided such a fantastic experience for me and my family! I had been...",
        "We used their service for a surprise bday party on 5/14. We really enjoyed it. The guys were all\nFriendly and fun. They offered to take pics and interacted..."
    ],
    "w0xXBgyA1wohg44WFkPtgQ": [
        "The service and food was excellent. I ordered the Hae Mul Pajeon, and was not disappointed. The Banchan were very good. It's served with a bit of homemade...",
        "Clean cute inside friendly service. \nOrdered \nYook gae jang \nKalbi\nSeafood pancake \nSteamed egg \n\nThe food ordered was priced well for going prices and all...",
        "I dragged my wife and brother to the car dealership and after an hour and a half wait there, she got HANGRY. My initial plan was to eat sushi at Mitsuwa..."
    ],
    "s3FHbLttI0k3exb7UT3Now": [
        "Been wanting to try this place for a while and finally got the chance! We knew what we wanted before arriving so we ordered fairly quick, service was fast...",
        "My family and I, have been here a few times now.  It's hands down my favorite Mexican restaurant.  I am super happy to live so close to them.  \n\nThe service...",
        "It is not always easy to find good Mexican food in South County. Our usual spot for Mexican eats in our hood had an early closing time for Sundays so we..."
    ],
    "K0vfmGnRYHwXMNW_S7mtyQ": [
        "Came here when they have their soft oppening. Friendly and quick service. Got free green ice cream for my walfe order. The walfe was amazing, made freah,...",
        "Such a wonderful gem hidden in the Laguna Hills area! Can't beat the price point either. The customer service is wonderful and their attention to detail is...",
        "tried the Hokkaido caramel milk tea.  Quality of tea was lackluster.  Did not adjust sweetness or ice.  Staffing appeared to have no tea shop experience,..."
    ],
    "QBl4RbZPi4TAu9C9sDbSzw": [
        "Great place for xiao long bao (soup dumplings) in OC).  There are quite a few Taiwanese/Chinese restaurant chains serving XLB in the LA/OC area (Din Tai...",
        "NO RESTROOMS INSIDE. you must walk outside up a flight of stairs, using a key that everyone else touched. Gross. I didn't know CA code would allow such an...",
        "My husband found this gem. Mind you my husband is a very picky eater. We have ordered their frozen dumpling and they are the best!\n\nA few times I wanted to..."
    ],
    "BGVSPUm0sbhit2vLlKet-g": [
        "Stop by and grab their chicken. Perfectly cooked with great flavor. You won't be disappointed.",
        "Cheebos is focused on delicious and diverse food!\n\nDelicious food with attention to detail that both innovates and hits those comfort spots.\n\nIf you have a...",
        "Can't speak to the food here due to the service (or complete lack thereof).  Stopped in here because the place that we were looking for at this address..."
    ],
    "u2ggh_LhrTnT9Rdz-NkuHg": [
        "Saw their post on instagram and decided to give it it a try. It did not disappoint! We ordered the salmon dish, pork chops and curry. Everything was cooked...",
        "Made a point to attend the LAST weekend of the OC Night Market and I had to visit the PHUUD booth. We ate literally something from most of the popular food...",
        "Every dish was delicious and flavorful.  The salmon was cooked perfectly.  My favorite was the curry!  Phuud is a great option when we can't dine out during..."
    ],
    "75VrUj0XjyumGWvdVI5n0A": [
        "Food is really good. Love their Xiaolongbao and the noodles broth is very tasty！ Definitely，I will come back again.",
        "Hidden gem for Chinese food!\n\nPros\n-lots of seating\n-plenty of parking\n-no wait time\n-friendly staff\n-the FOOD!!! Dumplings were amazing, rice cakes on...",
        "Umm... Came on Sunday afternoon, and the restaurant was about 3/4 full. I went to the cashier and told him I wanted to order take-out... Proceeded to take..."
    ],
    "MsKPLBIlL09x0KiMksgeYw": [
        "Hands down the best juicy Kubide ever. \nFive star service. Looking forward to the next visit. \n100% recommendation.",
        "The food is so good! I had the chicken koobideh and it was so juicy, tender and delicious. \n\nOnly reason I didn't give 4 stars is because the service. I...",
        "The food and service here was amazing! I tried the chicken kebab and they were delicious. \n\nWe dined in recently and then also recently got take out from..."
    ],
    "7DAmbLU78TlQVFcRwXklYQ": [
        "Garlic noodles with ribeye was delicious. The fried rice was excellent. We did take out and it was still hot and fresh when we got home. It was truly yummy....",
        "I came here with some friends close to their closing time so it was pretty empty. I decided to go for their garlic noodles, and I was pleasantly surprised...",
        "Fam's Kitchen has been on my yelp bookmarks as a work lunch spot for such a long time now, and I finally had the chance to try it.\n\nI ordered the saltado..."
    ],
    "WXmm3IzTjp0B7iZK0zfOHQ": [
        "Nice evening as usual! Great food, excellent service in a very comfortable patio! Ironwood is confirmed as one of the best options for us in Mission Viejo....",
        "The food was too bland and had to order some extra sauces. Portion sizes were decently large. Everything was good, we ordered buttermilk chicken burger with...",
        "When you enjoy sharing because the steak is too big for one person.  \nJust enjoyed sharing the 45 day aged bone-in Ribeye steak with blue cheese mashed..."
    ],
    "S6TI_8Qd0iHJm0UMEqraIA": [
        "Came with my family of 10 for breakfast. Excellent food. Everything was great!\nOnly downside, first ranch is free after that it's $.75 for more. My people...",
        "Run don't walk to this new place in Lake Forest.  As kid growing up in San Diego I loved on California Burritos.  You know the ones with a simple recipe of...",
        "Decent value for quick dinner. Food comes out very fast even if the restaurant is relatively busy. Whole meal came out to $24 for 2 people.\n\nCarne asada..."
    ],
    "_IbQ2qgzRH2Gb4M3iyAVHA": [
        "First the sushi and soup were pretty good. But the \"ramen\" was actually instant noodle priced at a ramen price. Overall everything is pretty good except for...",
        "Authentic old school Hapanese food. Everything is free and delicious.  I loved the Beef Sukiyaki. The sashimi donburi was excellent.",
        "Small mum and pap Japanese shop, orderd the deluxe kaisen donburi, oh, I want to gate keep this so badly, it is $30 dollars, the sashimi pieces are fresh..."
    ],
    "DiPR0Y-CfD7H5yIMiaGcbw": [
        "great taiwanese food!! they have been around for YEARS but keep switching locations (they were in tustin, irvine, maybe back to tustin again??? but now lake...",
        "O'Shine Taiwanese Kitchen is a local gem. \n\nOrange County is home to some of the best Asian cuisines outside their home countries but the Taiwanese variety...",
        "I want to support a local business but unfortunately my food was not good and also very expensive.\n\nI paid almost $20 for two items but the amount of food..."
    ],
    "ugle3N-d_F9Nt0_NEPvIDg": [
        "Very cozy and tasty place. Staff are nice, friendly and taking care of their clients. \nI've been here twice with my wife and will definitely come back....",
        "Loved the food, the ambience, and the wonderful waiter, Tim!  He was great on the phone taking reservations.  Then, welcoming and courteous while waiting on...",
        "Food was great and service by Diko was fantastic. He suggested great food (the trio and the shrimp & ouzo saganaki, which comes out flambéed for a great show)."
    ],
    "aibYeP7eZKqvoL4ckM8GnA": [
        "Excellent burger! \nAlways love a great burger on the weekend and this place was my choice yesterday. The staff inside who assisted me with my order were...",
        "I really like this place. It has tasty burgers, fries, chicken sandwiches and fries. Staff are friendly too and the meat they say is halal which is a plus...",
        "So,....  We are a couple who looks for the best burger to enjoy.   \n\nWe have been using this spot for a very long time. \n\nIt is the best burger.   \n\nAnd we..."
    ],
    "gQG8YHzHpa8L__UnRr0TRA": [
        "Jonah- you guys made us feel so welcome. I was sad to leave your restaurant. Your food was amazing. I hope you guys stay well and be healthy!",
        "What a great restaurant. So happy to have stumbled upon it & a bit of FOMO for having only found it now. \nThe day before Mother's my sister planned to come...",
        "Pretty much bland food every time I go.\nMaybe I'm spoilt from tasty foods I've eaten elsewhere!\nIt's an ok place to go for a catch up with friends and drink."
    ],
    "lCLvCOEilXTiB9NXbhHPoA": [
        "A complete delight! My mom lives near by and had wanted to try this, so we stopped by after she and I had a workout that day. We had a hard time perusing...",
        "Delicious food, average prices.\nWonderful location to be outside with a table full of friends.\nExcellent service.\nLaid-back vibe.\nNice drive!\nA Canyon...",
        "This place is pretty cute! \n\nLocated off Lake Forest, this eatery has inside and outside seating, there is decent parking. \nWe went inside and it was very..."
    ],
    "VBbD9VdzTh5PznDU5p2fCA": [
        "The birria is out of this world  \n\nI ordered it on doordash and got like 5 things because it all sounded great. I cannot stop eating it. I'm going to dream...",
        "If you don't speak Spanish, and if you're not a patient person, you're shit out of luck. \nNo one here speaks English so cross your fingers and toes and hope...",
        "Don't you hate it when you go into a restaurant and you have to ask for everything you want\nCan I get a beer please?\ncan I order now? \ncould I get another..."
    ],
    "08WvlXEbj8etnYDNqlLmQA": [
        "Great food and great service! The quality of their food and drink items is excellent and they've got a great ambiance. Nice addition to Aliso Viejo.",
        "This was our second time trying this new restaurant/bar in Aliso Viejo\nsince our first experience was shortly after they had opened.   The second visit...",
        "Finally made it in after hearing neighbors rave about it.   Had the \"Hoppy Hour\" burger and their house wine...both great!  The burger was probably one of..."
    ],
    "_rj3OjBh2ggy7YJe4vyGEw": [
        "If you're in Southern California and looking for some delicious chicken, you need to check out this 5-star fast food restaurant!\n\nFrom the moment you step...",
        "I have grown up around here my whole life and came in last Saturday. I was amazed by my experience and the customer service. One employee Idean was...",
        "Dave's Hot Chicken is an absolutely amazing fast food chain that serves up some of the most delicious hot chicken around. This restaurant has quickly become..."
    ],
    "bOjKIEccUO55SZoKjuj-7Q": [
        "The chicken was moist, fresh, and crispy. I really enjoyed the ambiance of the restaurant. The customer service was amazing. Moreover, we ordered different...",
        "I just can't even believe the amount of flavor in this chicken!! It's amazing! I got the \"hot\" level sandwich. A big piece of chicken sticks out from the...",
        "They do a good job of preparing your food fresh. My only complaint is the saltiness of the breading on the chicken. Ordered it Country style (mild) so you..."
    ],
    "hPEHYS_RuhFL4lZQvg9NoA": [
        "Best authentic Lebanese food !\nMade fresh daily and Bilal (the owner )always explains all the ingredients in each plate and always happy to see you back",
        "Very very friendly staff, the ambience is very peaceful and they have a TV playing sports which is nice. Food was delicious and the environment is very...",
        "The highlight of this charming Lebanese kabob and shawarma joint is, without a doubt, the delightful food, perfectly spiced and cooked to perfection...."
    ],
    "5iSryUs-TdD3_VchfH8Kmw": [
        "Love this neighborhood bar -- but the real secret is in their amazing menu. My personal favorites are the short ribs, chicken Caesar, Brussels sprouts,...",
        "I had an amazing experience at this restaurant. I must say, Jill is the best waitress I've ever had the pleasure of being served by. She was attentive,...",
        "It had been several years since I'd been here, but a book club I'm a part of had its meeting here.\n\nI was more than excited to come back here since I knew..."
    ],
    "fOu6OKqUaAc_3jalEp0cfw": [
        "Really good tacos de birria.  Fast service too. There is always parking.  Friendly servers.",
        "I got suggestion on Yelp about this place.  I had to look up the address to make sure I was understanding exactly where it was.  I looked at it from G earth...",
        "You're not going to church, but you're mouth will definitely have a religious experience. Wanted to try a new place and after all the reviews I decided this..."
    ],
    "V7zdXNHM5ZkNV6gYeEsa8w": [
        "TRY THE BANANA PUDDING! Do not leave until you do. You won't regret it. I've never had anything like it. The other food is really good too. Brunch, especially.",
        "Needed a quick pick-me-up on a Friday and this place did not disappoint! It was a quick order and I did not have to wait at all. \n\nI ordered the seasonal...",
        "Their breakfast burritos are great but I recommend the veggie one since the other one is a little too heavy. It's full of roasted veggies and is more..."
    ],
    "JauiecB5oyjQecYdd4WjSA": [
        "Food is excellent. Healthy and fresh.\nWe had cheese omelette with tomato and egg burrito with salsa at the side. \nI will definitely be back!",
        "we really like this cafe.  it's small,quiet,and simple (there is outdoor space too!) but the most awesome thing to see was condiments at the table!...",
        "Sweet little place.   They made my food exactly as I requested  and were gracious with my food allergies.  \nLoved the little touches of cute dishes and my..."
    ],
    "uw8AwzJHcx5tkkQPUBDgtw": [
        "What a great place!! Had a great experience tonight with a couple friends. We each got a boba drink: taro milk tea with boba, brown sugar with boba, and...",
        "We ordered a few things.  I'm vegan but the tofu bahn mi tasted like fish so they probably fried it in the same oil.  Service was good for takeout.",
        "This newly opened Pho place is my favorite Pho place to eat at in the Great Park area. The food is fresh and tasty. The service is kind, attentive and..."
    ],
    "Xqvg__hOFtgtIPa_B3J8LA": [
        "A visit to the newly *revamped* Forest Cafe being way overdue, I finally caved in last weekend. It seemed I arrived at a perfect moment where I was at the...",
        "This is definitely a spot that we go to regularly because the food and donuts are just delightful.  Specifically, the shrimp burrito.  It's the perfect...",
        "They need to repost their hours!\n\nI'm in Irvine for some on site work and got here early so I thought I'd have breakfast. I looked up breakfast restaurants..."
    ],
    "aYmZ4CSmNPbrYW4fWBAqiw": [
        "Good Korean food that's quick, and you don't have to trek to Irvine.  This has become a regular stop for my family when we want some Korean grindz in a...",
        "Korean BBQ To-Go is a truly amazing place! You should give it a try right away because you won't regret it. The menu is thoughtfully curated, with plenty of...",
        "I'm a bit mad at myself for not reviewing this place sooner!\n\nFirst let me just say, I love how friendly everyone here is, it has a family business vibe to..."
    ],
    "mn-KisVCcB4xdImY6v6wGg": [
        "Hidden Gem. \nYou normally try to dodge your lobby bar/restaurant or resort to it as a last resort. Came in here with this mindset. \n\nThey won me over with...",
        "We had food and drinks catered by the Old Camp for a party in one of the hotel banquet rooms. Monique was very responsive and easy to coordinate with before...",
        "Amazing food and great service. Try the ahi burger. Their poke isn't bad either. Have fun!"
    ],
    "V8KXkj4sDhRlS5G6z8-79g": [
        "Went to Fukada's for the first time after some suggestions from friends and TikTok! Food and service were absolutely spectacular!! Staff was amazing and...",
        "I took my brothers here right as when they were opening on a Sunday morning and it was already packed! I was expecting a dine in situation but they do \"take...",
        "I used to come here a lot for 10+ years. Hot tenuki udon is so good! But since going gluten-less for gluten sensitivity, I needed to opt for something..."
    ],
    "Y7XCdPOckmqG6CXNDIqOnw": [
        "Delicious food and kind hearted staff.\n\nLots of good options, chicken dishes, soups, curries and beef and pork as well. Spicier than average mild can be...",
        "Tried out this spot during lunch during the week. Depending on what you order, or can take a very long time for food to come out. I was on an hour lunch...",
        "Ambiance is very casual.\n\nOur server was very attentive from the time we entered upto the time we left. The place got busy after we came in and our orders..."
    ],
    "eaVl6H9_BXeUuE8GA6Aawg": [
        "It's beautiful restaurant and the food it's delicious ,and de service,really loved ,the drinks  too",
        "Was visiting California and gave this place chance for my first dinner in Cali. Food was great and loved the service! My server Mikey was awesome. Very...",
        "I come here very often and the chips and bean dip is amazing! Also, Julianna makes the service 100x better and she makes it a very comforting place! The..."
    ],
    "LEZgwZWrpLTtID0NNwfdAw": [
        "Amazing food. Everything was so so good. Our server Ryan was so attentive and just overall such a friendly server. I can't remember the last time that...",
        "Food is very fine in quality and service is equally good\nYou got to have reservations for dinner otherwise you may have a seat in lounge\nBar is particularly...",
        "Hanna's Restaurant & Bar is an upscale dining destination located in the heart of Rancho Santa Margarita. From the moment you step into the restaurant, you..."
    ],
    "d4Nyq4rVAsmln1Q-Ze6HFg": [
        "Came here for Happy Hour and enjoyed appetizers that were a few dollars off as well as cocktails for a small discount. The Moscow mule was served just right...",
        "Mediocre compared to  few years ago. The menu is a strange mix and uninspiring. The food is just okay\n\nWay to expensive!\n\nThe best thing they have going is...",
        "They have a really great location.  The drinks menu is really creative.  Vegetarian options are extremely limited; the shakshuka was good.\n\nThe number one..."
    ],
    "n6O898djCleCZTSoJcEn8w": [
        "It's an amazing place full of respect peace and quiet,\nBeautiful view with awesome indoor and outdoor decorations,clean parking lot and great food we...",
        "Wonderful Middle Eastern restaurant- I love this location much better than the former Irvine restaurant... it's closer to where I live.\nThis restaurant is...",
        "Very clean spot. Friendly. Spacious. Modern. Love the bar. Outdoor patio is on point. Bathroom is clean. I love the ambiance and the tech features they..."
    ],
    "esucYe7Msn6fzZfbLpVzzA": [
        "Yummy Ramen  very good service. The wontons were amazing deff recommended that for an appetizers",
        "BY FAR the BEST restaurant in RSM. My family has lived here for almost 60 years-- we have seen restaurants come and go, have dined locally at fine dining...",
        "The tonkatsu soup base is tasty, added couple drops of chili oil, so much tastier. Love the Bok Choi, bean sprouts, wood ears, and green onions neatly..."
    ],
    "Znr4Ey1hsyYCT8LD9U6qIQ": [
        "I was so excited to see a Taiwanese restaurant around our work area. I came here about 3-4 times. I remember the first time it was crowded and so busy that...",
        "I was super excited to try this restaurant because I had it often when I lived in Rowland Heights. This place is solid in terms of taste for authentic...",
        "We came about 1 month after opening. The dining room is full so we waited about 20 min. We were able to sit down quickly. The food is authentic Taiwanese..."
    ],
    "1S5JmpeafG1_u1hcE7C1QA": [
        "A true one of one. We have been eating here for almost a decade and although the original owners have retired, their recipes live on. \n\nMust try: gourmet...",
        "This place has a cozy vibe. No frills or fuss. They serve classic  Italian dishes made from fresh and simple ingredients, not like the other so called...",
        "A little gem in the neighborhood.  I love the food!  Especially their turkey panini and tiramisu.  Yum!"
    ],
    "Bs7sudWQQjK08hNuzD0L3A": [
        "My wife and I love this place!  So happy to have a nice restaurant so close to home.  \n\nDominico's is located on Lake Mission Viejo in the old Peppino's...",
        "Wow! Where do I begin. I've eaten at other Italian restaurants before and definitely consider Domenicos as one of THE BEST.\n\nThe dishes were well composed,...",
        "The service was amazing, everyone was super attentive and checked on us constantly. We felt very welcome. The knock on stars comes on the food..."
    ],
    "MS89AYbaOqOKeG3eGZGdBw": [
        "Cool family owned Lebanese foodie spot...\nDid I mention fresh? So fresh their bread is baked in-house....yeah, that fresh!\nTry the Kafka wrap, you'll thank...",
        "This used to be good. They have good sides. Everything is more on saltier side. Now I want to know where is the chicken in my chicken platter?! Am I paying...",
        "Small little restaurant that exceeded my expectations! Great price that includes lots of food.\n\nI think the platter is a better bang for your buck as..."
    ],
    "evlKzYToWhXZRurbN1HUXw": [
        "One of my favorite small local owned places. The food is a tad pricy, but the portion size and quality of food are IMPECCABLE! I used to visit their...",
        "It wasn't worth the half hour wait to order. This was a Saturday morning at 10:30. We waited 30 minutes to order. \n\nThe food was decent but nothing special....",
        "Food is amazing.\nSize portions are very generous (share). \nService is amazing. Joe is so delightful, fast and attentive, and always greets us with a smile...."
    ],
    "A8R2P2I14-cgOU9IlLmnKQ": [
        "This place makes the best filipino food in Rancho Santa Margarita if not Orange County, California! I love their crunchy Lumpia, Crispy Pata, and roast...",
        "This is not a store or restaurant. This company operates and makes the foods from her home \n\nThe communication is bad with Christine, I believe the owner of...",
        "My husband and I went here with my cousin to try some filipino food around the area. We found The Lumpia House and were very lucky to find this place. They..."
    ],
    "_w7L99LOdJRAp-4iwALyqA": [
        "Food is excellent bakery top of the line customer service Amazing, I may have to go every week Very cozy atmosphere. LOVE IT",
        "If you want to feel like you're in France for few hours, then you must check out this beautiful cafe! The food tasted like French made and dropped off this...",
        "so cute and friendly!! i adore the staff there, the nice lady who was serving us made us feel very comfortable. the food looks and tastes amazing, i feel..."
    ],
    "3achrvpW6PEhLTk5TxD9cw": [
        "This is one of my favorite Mexican spots in the OC. I used to come here like once a week when I worked nearby but now that I live and work further from it,...",
        "Small family run spot, serving up a delicious array of burritos, platillos, enchiladas, and quesadillas, plus American classics.\n\nI came here with my mom on...",
        "Food is fresh and great\nThe server here was friendly and attentive \nAmbiance mom and pop vibes"
    ],
    "ipruj_E11FkGbgwxwylSzw": [
        "If your a picky Filipino eater like me looking for chicken lumpia this is the place! I order 100 pieces of chicken lumpia for $50 plus tax.\n\nWas a great...",
        "Filipino food with mini store.\n\nHad ampalaya and sisig. Big serving, you would want to get more rice. Sisig was a bit salty but good.\n\nPlace is clean, way...",
        "I had actually forgotten I'd been here before. I came to write a review and realized I'd been here before, 15 years ago. \n\nThis isn't the same place as I..."
    ],
    "g_7S2kgE7NCqPGtvcJcBrg": [
        "A great place to dine on the beach on a warm sunny day.  The covered deck kept the sun away, while allowing the cool breeze to flow through.  The sound of...",
        "Great place to come! Enjoy the beach after breakfast or lunch. Must come early to be able to get seating with no wait time. We got there super early and...",
        "The location alone is a must ! You can drive or go Down four flights of stairs to get here . ( I took the stairs ) \nIt's totally worth the stop. Quality..."
    ],
    "d_Oj3R17iroUGz0X_MHlTQ": [
        "Went for brunch with a reservation! it wasn't packed at all so theyre not always needed. The service all around (valet, hostess, waiters) was great! All...",
        "Barely three stars.\n\nAfter being at the other restaurant on the property, Andrea, I thought the Pelican Grill would have great food as well.\n\nThe Andrea,...",
        "the view was beautiful but my experience was horrible I visited from out of town and had the greatest recommendation for this \"upscale golf lounge\"..."
    ],
    "ayiDYSW-C5NP0jvCYXRD-g": [
        "Had been wanting to try \"A Crystal Cove\" for quite a while. Hard to get in on weekend so made a reservation during the week. Beautifully done interior with...",
        "Good vibe next to the beach and nice interior design with a full bar. The steak and egg was so delicious and drinks was good! Lobster egg Benedict was...",
        "Arrived at 6:30pm Thursday eve for dinner and it was Poppin! A Crystal Cove is an elegant supper club vibe much like the 1230 club in Nashville. We were..."
    ],
    "aMeRSgPPrrH_cqJqcwtA6Q": [
        "Brought my wife to Nicks for dinner our 10th Wedding Anniversary on 5/11/23 and as usual it was really good. We didn't have a reservation for the evening...",
        "Updated review from the last time... thankfully the manager reached out to us because sadly I've been back and that same bartender was there and walked out....",
        "Best service ever - our waitress was the kindest. I think her name was Sheri. We came in for my girlfriend's birthday without a reservation and she really..."
    ],
    "hjHZmeQ5NAxj6CWj06KY9Q": [
        "Originally we were going to Crystal Cove State Park but then it was really cold! We ended up going here instead. We got lucky and didn't wait long for...",
        "The Shake Shack is the best place to have burgers (and shakes of course) with a view! Arguably the best beach-view for burgers in OC since all seating is...",
        "I visited from out of state on a very busy Sunday. The line was long but it kept moving. I overheard a patron say \"I've never seen it so packed before,\" so..."
    ],
    "781F5q3N17g-gzJWtgJxUg": [
        "Food-Delicious and Filling. Beignets were amazing. Breakfast burrito was definitely worth the money and fills you up on just half of it. ZoJo...",
        "This was hands down the best Lobster Mac I've had -  AND had a huge piece of lobster meat in the middle. It was creamy, delicious, and full of flavor. \n\nMy...",
        "May 21,2023 (Sun 6:24pm):\nOur first time at the Lighthouse, and we were excited to try this place. BIG MISTAKE!\nWe had a reservation for 6:45 pm. We arrived..."
    ],
    "UjRUYrYR40BNSWOH291XWQ": [
        "Came here tonight with my best friend and it was alot better than I expected for a restaurant thats fully packed.\n\n1) GREAT service. Attentive and not...",
        "Crazy to think this place has been around since 1926 and I had never even heard of it! We had dinner here with friends, of course we ordered a ton of food,...",
        "I ordered scallops with risotto.Only 3 scallops on plate cooked fair, but the risotto was bland, like they forgot the salt & Parmesan cheese. Had to ask for..."
    ],
    "tyEn0CPyJpCM78EQfFtkow": [
        "Amazing Mexican food. Great place for birthday or business dinners. Staff is always attentive and food comes out quickly!!",
        "Came here for my birthday dinner with my fiancé for the first time. \nPlease, be aware of the parking situation as they only have valet and no parking spaces...",
        "First of all, the entire parking lot in front of the restaurant is valet only-which is super annoying on a Saturday at 2 PM. I move my car around the corner..."
    ],
    "MhP50RHihkw-DlQQjDvhIQ": [
        "Discovered this place through a friend of mine and after trying out their Gnocchi I knew I had to come back. Their sauces are incredible and the tagliatelle...",
        "Every time we go to this restaurant it's beyond excellent. \nFabulous menu and wait staff. Our server Alanda was one of the best servers we've ever had. She...",
        "Great spot in Crystal Cove! \nTasty dishes and moody ambiance make for a nice date spot or stop by the bar with a friend. \n\nMy favorite dishes are the..."
    ],
    "cgxyz3orChaxo7nCm9opHg": [
        "AMAZING food!\nI got the bear flag burrito which was phenomenal (make sure to get their Tommy sauce to pair with it!) as well as some chips with poke. It all...",
        "I've been a long time consumer of Bear Flag and it rarely disappoints. I has been in a while since coming here because my go-to dish is the ahi poke and I...",
        "My goodness this place just never gets old! Long line on warm weekend days, but worth the wait. The poke bowls are a great price ($12-15) and soooo yummy...."
    ],
    "8ucHIuC7-_JuJcnlYRjaMg": [
        "The Cliff has decent food, but it wasn't anything special. The fish n' chips were one of the better ones I've tried, but unfortunately, the pan seared...",
        "Great location...beautiful view....love all the little stores around it....\nElijah was a great Host \nWaitress was Ok...\nSalmon dinner was just Ok...\nBread...",
        "Incredible view, good food and beverages. This is are \"go to\" spot in Laguna. We love it as it sets the tone for our yearly oceanfront vacation.\n\nThis past..."
    ],
    "jmtpj9xs5qLumYIMd2v5lQ": [
        "We had the pleasure of dining here last Saturday evening to celebrate our anniversary!\n \nOur experience was wonderful from beginning to end, we appreciated...",
        "So many things to say about this location! The food was phenomenal! We knew that the portions are large, but of course, we still ended up over-ordering...",
        "If you're interested in a ritzy spot, with lackluster food, this is the place. It sells itself as a high tier restaurant and it looks the part on the..."
    ],
    "xQQ0L3zha2-3zehLh889bw": [
        "I've visited this restaurant numerous times over the years but I don't think I've ever fully ordered off the regular menu. Pre-pandemic, Marche offered a...",
        "This place is phenomenal! If you haven't tried, you must.  You will not be disappointed. Our waiter ( Alan) was top notch. He was very knowledgeable and...",
        "We went on a dinner with another couple after hearing from a few different people that it is the best authentic french restaurant in Los Angeles area. My..."
    ],
    "9s2HSbNKM_8Ay0o8k9d5CQ": [
        "I love my hideout place \nThis is my favorite lunch place.\nGuys making Quality foods.\nfor Ritch\nroll\nHandmade potato chips\nHome made lemonade",
        "Wonderful place while you are at the beach.\n\nFavorites:\nPoke Bowl\nTuna Melt\nClam Chowder \nHouse-made Potato Chips\n\nWonderful flavors",
        "The service was great food was a little pricey to be expected the fries were a bit to soggy for me the lobster roll was okay it wasn't amazing, the jetty..."
    ],
    "gvk0vypjJSwZIeL2ybbolA": [
        "The service here was perfect!!! Everybody was friendly. The manager Jacque made sure I was well taken care of. Me and my family will be coming back here for...",
        "Food was very good the staff were over the top and the ambiance was the best in Newport Beach. This certainly is the newest and greatest in places not to be...",
        "great food, great atmosphere, great clientele. Elijah from Texas was a beyond good server. personable and very informative with the menu. props to him :)"
    ],
    "u31pxZqQbajByULMCF6bEQ": [
        "Best service I've ever had, it's fast friendly and efficient. Super nice atmosphere that makes you feel comfortable and the staff makes sure you're taken...",
        "Always a great experience at Mamma D's! The entire staff is prompt and attentive and always friendly, the food is always fresh hot and delicious, and the...",
        "Mama D's is so freaking good what do you even say about this place, 100/100 would recommend \nFood-AMAZING\nService -SPECTACULAR. Always so nice \nAmbiance..."
    ],
    "UCzdjLP16YWk0M3IruKPtw": [
        "John, the bar manager was very attentive and makes you feel comfortable. Ordered the food was delicious Tavern burger and Truffle fries",
        "Just come to the bar and ask for John , he is so attentive and nice and make you feel like special",
        "First time dining here and we selected Tavern House Kitchen based on their French Onion Soup picture. We were not disappointed. My husband and I enjoyed it..."
    ],
    "v0jfgLaeoOTf_WMHPkjHqg": [
        "Great food, Great views, great service.  Dinner was fabulous, the views of the ocean with dinner was priceless.  Definitely recommend.",
        "Nothing but Great Seafood, Energetic Staff, Nice Ambiance, with Awesome Views overlooking the Sand.\n\nFavorite Appetizer: Spanish Octopus & \nScottish Smoked...",
        "Do you like raw chicken? We don't either, but 3 of us at our table received raw chicken. I also have a dairy allergy and was given a plate with dairy due to..."
    ],
    "W0fNFjcNhUFQMrGUOt3Otw": [
        "Tatum was an amazing server! She went above and beyond to help me find gluten free options. As a Celiac, I felt really safe eating here. Thank you, Tatum!!!",
        "Delicious, fresh Mexican food - awesome marg/cocktail list, and friendly/attentive staff. Loved the decor as well!\n\nFavs: Champagne Salad, Guac, and Spicy...",
        "The Pollo a La Chipotle was well seasoned and one of the juiciest chicken breasts I've had! A perfectly savory bomb of flavor but not too over powering. It..."
    ],
    "K7Q4UxwxiVVWmTe_1fZKbQ": [
        "Fantastic Omakasa lunch & lunch bento box\n- fresh , fresh ,super fresh sashimi & nigiri.\nMust try with kizami wasabi.",
        "Manager is rude and does not carry himself with etiquette one would expect to manage fine dining.  \nI took my daughter there because I had good experience...",
        "Had a great time here celebrating my husband's birthday with our neighbors.  All the food was fresh and delicious.  We were seated on the beautiful patio,..."
    ],
    "86Hicsz5D0Tr9SAGSt9asQ": [
        "Amazing food, sincerely some of the best food I've ever had. \n\nService was friendly and personable. \n\nAnd the atmosphere is very chill and laid back.",
        "05/13/2023\n\nWe came here for a late lunch/early dinner after watching a movie. A handful of people were inside so there were tables available. But after we...",
        "Everything was just okay..... My boyfriend and I didn't find anything special about hook and anchor. We ordered the 6oz Lobster Roll which was at market..."
    ],
    "QOU93bhvux16IidqvURwvg": [
        "for starters, i don't get the hype about the maple bacon donuts. it might be because i had high expectations from so many reviews... \nthe donuts were dense...",
        "The food was great.\nThe service was great.\nThe ambience was great.\nThank you for your kindness and terrific dining experience for me and my son.",
        "Maple Bacon Donuts - 5/5, not usually a donut fan, but this could've changed me. 10/10 would get again.\n\nHash - 3.5/5, somewhat disappointed. Not much..."
    ],
    "0LWmwzoYfiw8U0S4V7lM6A": [
        "SOPHISTICATED PICKLE \n\ni LOVe pickles and this establishment serves a very fine one\n\nPlump and juicy. \n\nCome here for the pickles 1000/10 \n\nYUH",
        "I've been to the Anaheim Hills location and recently learned that this Laguna location existed! Family and I came here for an early dinner. It's a really...",
        "Review \n\nIt pains me to send this review. I had the worst experience EVER at a local business that I have frequented since their opening....REUNION, Laguna..."
    ],
    "qa5Rhcwn9QxeJGwSnapkyA": [
        "Both the food and service were on par! Javier, our server, was very attentive, but not intrusive. He had great menu recommendations which we really...",
        "The chicken was amazing, crunchy, flavorful, probably the best Friedlich chicken I've ever had.\n\nIt's Served only onFriday's and it's a meal for two. We...",
        "Ambiance and drinks are great. Food was okay. Meatball super salty. 5\nMac n cheese app was bomb.9\nFried chicken- 7 nothing to write home about"
    ],
    "dOYLSWRRPtwQqy0ha5gi-w": [
        "The ambiance at Farmhouse never disappoints. So glad we got to make a reservation for this early dinner with our furry family member too! I ordered the...",
        "Absolutely amazing! Very yummy food, fresh and unique flavors. The waiter was very attentive, and helpful when we had questions regarding the food item. \n\nI...",
        "We came here for dinner on Saturday and were seated very quickly. There was also a good amount of parking which was great. The ambiance was very charming..."
    ],
    "9wDtu9JYeCdId__I8INuAQ": [
        "I've been here 2 times and both times the food was amazing. Also, love the ambiance! Plush teal velvet booths and the gorgeous bar. \n\nThe first time was a...",
        "The food was excellent, but beware the menu is seasonal. I wanted something that was no longer offered. All good though. We started with the octopus and...",
        "Oooo this place makes great food and drinks!  It was a bit of a struggle between 4-5 stars.  4.5 is where I would have landed this establishment.  First..."
    ],
    "PGkjBe9mI9tPeHWdZF-27A": [
        "Incredible food and service can't wait to come here again!\n\nHusband got the lasagna. And I got the ravioli (half cheese half meat order) in pink sauce....",
        "It saddens me to make a negative review on my beloved Mama D's. \n4 stars and a negative review might be shocking, but all I got to say is this is the first...",
        "The Pink Sauce. \nThe cheerful staff. \nThe family setting. \n10/10 \nWhenever we are in the area, this place is top of the list."
    ],
    "x35pPu2e03ncy0y7Vilh2A": [
        "Starfish is a diamond in the rough. It's next to a CVS so you wouldn't expect to find such a nice restaurant. \nThey have happy hour every day from 3-6!! You...",
        "We just celebrated a co-workers bday here with the team and their spouses. Normally greeted with a warm smile by Hannah but she was not there. Instead, we...",
        "I was looking for sushi places to go to that also served other food, and this place popped up! It truly did NOT disappoint. My friends got some sushi rolls..."
    ],
    "vgxOLfGMou_kaxAEU9VBTA": [
        "Food - focus is on spit roasted BBQ chicken, beef ribs, sausage and ribeye among others.  We had the fall off the bone beef ribs, yummy!  Came with slaw and...",
        "We have been dinning and drinking at Bandera since it's opening so we have a succession of experience there to draw from. That said have always enjoyed...",
        "I'm only giving you guys a 4 stars because you took my cornbread off the menu!! I'm from the South and my God you guys have some gooooddd cornbread! Bring..."
    ],
    "eFhga3TESF5kOE3u4f1GOw": [
        "Love love love this spot. Actually becoming like a second home!  Not sure if that's a good thing considering I stay at the bar. But hey! \n\nEvery dish we...",
        "Yes, this is part of FiveCrowns and is accessible thru the....Side Door. This is the bar area of Five Crowns and is an absolutely fantastic pub area to hang...",
        "Me and my friend were looking for a place close by the beach and stumbled upon SideDoor on Yelp. There weren't anymore available reservation slots but..."
    ],
    "fTPlPWt9G1Duk0jTCQ499A": [
        "New favorite spot for Korean food in Irvine! The quality of all the banchan and main dishes were authentic and delicious...everything tasted home cooked (in...",
        "Food is amazing. Everything was great including the cold noodles. I would also like to mention that I hate any kind of cold food but this was good....",
        "The parking lot in this area is terrible. And if you manage to find a spot, congrats, you've won the parking lottery!\n\nThe service is friendly, and if you..."
    ],
    "VM84llN9yfDXCw_3kucR4g": [
        "Food is pretty good and service was great. The view is beautiful and the music is good too (electronic / upbeat). However, there is no parking nearby (valet...",
        "Fabulous! Literally on the ocean front and Mother's Day approved. No reservations but got on the waitlist. Waitlist was about 2 hours for this busy mama day...",
        "Unfortunately, we did not have a great experience here. The entree took over 30-40 min to come out. That's after 1.5 hour wait for a table. \n\nWaiting would..."
    ],
    "KBcvMvI_b4mrXo-VH1doag": [
        "Food - so delicious \nService - friendly sever expiate process \nAmbiance - quite & good vibes",
        "Dover sole fish 9.68/10- one of my absolute favorite fishes, Gulfstream truly knows how to perfect the Dover sole fish. Breading it perfectly, this fish is...",
        "While sitting at the bar waiting for our table, I looked around to realise that everyone else in this bar was ridiculously beautiful. Every single person..."
    ],
    "sPy6EAjDOcxRmkgg3drODQ": [
        "Perfect view near by the beach, awesome food and services!! Fantastic place to go.!!!",
        "This is definitely a spot to go to during the day or before the sun sets for the gorgeous ocean view.  This spot is located in the Surf and Sand resort....",
        "Stopped by for some drinks, was accommodated immediately and sat at the bar. Service is great, people are friendly. Expect to spend some money here,..."
    ],
    "S3hbb3uJMA53S83vw0T4pQ": [
        "Turkey burger..Bun was super soft the turkey well done.. nice hot and crispy sweet potatoes fries. Lots of condiments to satisfy every ones taste buds. Lots...",
        "Can't speak for the food because I didn't get to try it. But we made a quick stop here (small 7minute wait to find parking) just to get a milkshake and we...",
        "Convenient little place on an awesome beach. Very limited selection. Nothing fresh except gas station sandwiches."
    ],
    "V5BwyLlpW3yXypFicUnJKQ": [
        "Our go to breakfast bar! Healthy fast food, and family friendly. \nService is fast and friendly. They have their regular crew, low to no turn over which is...",
        "Mustards is an OC staple - I've been coming here for years now. Atmosphere, food, people are incredible. \n\nMUST TRY:\nPotato Pancakes \nAlpine chicken \nTomato...",
        "I recently tried the egg and cheddar panini at Mustard cafe, and unfortunately, I was very disappointed with my experience. Firstly, the bread used in the..."
    ],
    "LAcpSgsApkR0hiHdfj0ubg": [
        "Anything to improve the carne Asada volcan taco?  Absolutely NOTHING!  Sheer taco perfection!",
        "so good, soft meat soft tortilla. good sauces. and good cooks. in the perfect spot too. looking to try the churros next time",
        "Great food, great prices, lots a variety, fast service and fresh hand made tortillas \n\nLove this place"
    ],
    "eW6f99JsPU-yFxiIlHJF-A": [
        "Been here a few times for brunch.\n\nIt is great every time my fav item is the chicken\nsandwich it's amazing every time  and comes to the table looking just...",
        "Came here for brunch this past weekend and it was our first time. We sat on their outdoor patio which has heaters and a view of the ocean. Started off by...",
        "I had this review in my drafts since February and I've decided to share them now, since I still have not gotten over the ill feelings I had back then. \n\nIt..."
    ],
    "xaw7Ltc0d8aFzr4G5imAmA": [
        "Highly recommend for a special occasion.\nIt's amazing but expensive.\n\nI believe that it's worth every penny but for me personally it will be reserved for...",
        "My friends and I showed up on a Sunday night and the place was maybe half full and it's a small place. Service was extremely slow and we flagged down...",
        "I'm really surprised by any of the negative views, as we had a phenomenal experience! We moved to oc from la a few months ago and tried a handful of Italian..."
    ],
    "jdredrgOj_AxGNuTWgDcMQ": [
        "This is an incredible restaurant! ...but unfortunately it is temporarily closed for renovations.",
        "Grand Hôtel Tremezzo is on the shores of alpine Lago di Como, short traghetto ride from Bellagio. \"One night only event featuring a curated menu that...",
        "If you stay at the Montage def give this restaurant a try.  The views are amazing and the food is great also.  We got engaged at the Montage in May 2016 so..."
    ],
    "82YpLX41DlJb-VQxfDzpZw": [
        "I liked it here. Good ambience. The kids meals are enormous, more like an adult meal. \n\nWhile I know the burger is supposed to be high quality, it had an...",
        "Well, where do I begin?  Let's start with a compliment. I used to really enjoy this place and look forward to coming here. \n\nIt has been a minute since my...",
        "Five stars for excellent selection, service, and food quality. Not your average cafe or bistro, Mozambique offers an excellent array of menu items for many..."
    ],
    "2XsUrXitHSqjDVHlwYLCBg": [
        "This what seems like a hidden gem is a whole vibe on the beach. \n-you can pay for parking, take a shuttle down ($2 per person) and get your ticket validated...",
        "Fun little bar to have a few drinks. Menu is just drinks and appetizers. The calamari, steak skewers and ahi tacos were good. Service was good. \nSeating is...",
        "Stopped half way through our hike for nourishment. Had the bootlegger cocktail, ahi tuna tacos, pork belly bao buns and chicken tostiditos. I loved the ahi..."
    ],
    "Df785UzIjKusM9RLPsEzKg": [
        "Food was freshly made and served hot! Service was great as well. The employees gave us a sample of the falafel, which tasted really good. The owner of zood...",
        "This is in the food court of Fashion Island, at the bottom level where the Barnes and Noble is. My mom and I were wandering around and happened to find it,...",
        "Food was great.  My wife and I had the chicken rice plate, and the chicken was incredibly tender and tasty!  The sauces and sides were flavorful.  \n\nAnd,..."
    ],
    "YLwSqDSZlDddXB4qFV62yw": [
        "Great location with a fun outside patio complete with a fireplace and heat lamps.\nThe service is always top notch as is the food! \nWhile most people come...",
        "I loved Selanne Steak Tavern! It reminded me of the pubs in the UK - cozy, inviting, and intimate with a side of meat and veg!\n\nEverything was wonderful...",
        "Food was very good. Shared a Caesar salad with the boyfriend, no anchovies! He ordered the scallop appetizer; you get two.  Said the scallops were fresh and..."
    ],
    "CFkB9gGGe6H_NqCrQj-hog": [
        "AMAZING PLACE! \nThe fish and chips were good \n\nWe just had a problem with the burger we ordered but I would like to commend the staff for being so...",
        "Abe was our server! He was the kindest and make our experience great. Laid back environment with good vibes. Indoor and outdoor seating. I really liked it...",
        "Great food, cozy ambience and great service. \nComfort food at its best. \nThe ribs were succulent and falling off the bone. The fish and chips were fresh and..."
    ],
    "fUx6z_jqlKTRbpDG_kfZJA": [
        "It's not the norm for bars near the beach to be Five Star locations. \nThose places would have to be very special and super clean. They\nwould have waiting...",
        "We ordered Moroccan salad with steak, bison burger, guava margarita, a drink I forgot the name, and passion fruit mojitos. Service was super slow. It took...",
        "I've been here twice and will be back for more! \nExcellent service the first time from the personable waitstaff.  I had the Blackened Ahi Tuna sandwich. It..."
    ],
    "sonzxwTs-KgxyFSkgnFXlg": [
        "We had a very nice experience celebrating my mom's birthday here. There were 4 adults and 2 kids. The restaurant itself was nice enough for a special...",
        "We found Zov's on this trip to Marriott Newport Coast. \nThe first day we arrived we decided to give it a try for drinks and light dinner. \nSat on the patio...",
        "If you come to Zov's and love seafood, MUST try the ciopinno!! It's a tomato soup base with a mix of seafood including mussels, shrimp, salmon, and..."
    ],
    "0-6M9UEezVHpVZWrZ8vmSA": [
        "Came here during restaurant week and was super excited because it's been on my list!\n\nOrdered the shrimp app, bucket, & fried ice cream.\n\nShrimp app was...",
        "We came here for Dine OC week.  Didn't know know much about this place except it looked like the Dine OC menu was a quite a deal.  \nOrder:\nLobster corn...",
        "Horrible, horrible, horrible! If I could give -5 stars I would. How is this place even in business?!\n\nCame here because of OC Restaurant week's advertised..."
    ],
    "t7dhysIQElH9DYXD-2ERfw": [
        "Quick stop for breakfast before the long drive home.  We both ordered the bacon, egg, cheese, & potato breakfast burrito in a spinach tortilla. She asked if...",
        "I understand the Saturday morning rush is a thing but it was a bit frustrating how long it took for our food to come out. We think it's because we both...",
        "This is the SPOT if you want breakfast burritos on the go while you're in CDM. They have a solid variety of food, but honestly, the burritos are the main..."
    ],
    "TqhuzJxO3A6jgf7JHGbBng": [
        "Collatte is amazing! She made is feel so comfortable to be here and took care of us with always keeping our mimosas filled. We came to celebrate Amy's...",
        "Great outdoor place to bring your dog, have a bite. Endless mimosas with POG juice were amazing. Collette was great!!!",
        "Amazing food and service, awesome live music and friendly family restaurant and atmosphere"
    ],
    "HtS8m3k06JEXHbjdGLZAkQ": [
        "Kind servers, pleasant ambience and delicious food! The espresso was amazing, as well as the huevos rancheros. They catered to rather specific requests as...",
        "Amazing\n..amazing...amazing\n The positive reviews were spot on for this place.  Amazing food and very friendly staff.  Don't skip by this one...you will...",
        "A really quiet and relaxing brunch restaurant inside the Hyatt with $5 valet. If you sit outside, you have a clear view of Huntington Beach with lots of..."
    ],
    "JehNQp0QSzPIElvbdTj4nw": [
        "My husband and I have lived in Long Beach for 20yrs plus, and we finally came to Pacific Hideaway after it was recommended by a \"NoCal\" couple who happens...",
        "On the second floor of Shorebreak Hotel is this pretty restaurant that is aptly named Pacific Hideaway!  There are nice interior and exterior seating...",
        "This restaurant is located inside the hotel on the second floor. You can park in the underground parking structure on sixth street and get your parking..."
    ],
    "WxUI7srzbXKgtWNlBCoiJw": [
        "This place was delicious! I got the nachos and the Simmzy's burger. It was so good! The nachos are extremely feeling and quite big. The burger was great as...",
        "Poutine carne asada fries\n-there is no gravy or cheese! Where's the poutine ! \n\n\nBillionaire burger \n-the aioli is super good. The buyer is cooked medium....",
        "Outrageous prices for basic burgers and sandwiches. I didn't notice the price on a basic chicken parm sandwich until bill arrived. $24 for a sandwich..."
    ],
    "swJs0EEKdj3JF6XzccG0Nw": [
        "I recently had the pleasure of visiting the Rooftop Lounge, and I must say, it was an absolutely fantastic experience! From the moment I stepped onto the...",
        "One of my favorite place in HB to have a drink, some bites and enjoy the sunset. I have never had a bad experience at Offshore 9. The service from the nice...",
        "Nice view and good small bites. Ordered a flat bread, fries, and sliders along with a bottle of wine. Staff was great and attentive. It was a chilly evening..."
    ],
    "9kmmV7TuQxQdLHcAqMAOvw": [
        "Was specifically craving Thai curry so I decided to come here and was so happily surprised.\n\nThe husband and wife who own the restaurant are absolutely the...",
        "Had some amazing pad see ew and kai kua noodles and our server Peter was so kind and friendly! Such a cute, home style, little spot that I'll definitely go...",
        "Still # 1,  I can't get enough of the Pad See Ew ( tried with Chicken, beef and shrimp ) It's all good !\n And the Yellow Curry OMG IS DEFINITELY one of my..."
    ],
    "-iQLD6KqtbfNrPGgXu0IYA": [
        "We were in from out of town - The service was great and our waitress offered tons of suggestions. Tinga, Pork Belly and Blackened Shrimp Tacos were some of...",
        "Recently chanced upon the OMK. It was a great experience of having wonderful food with amazing service. At the entrance heartily welcomed by Ms. Travin. She...",
        "Lobster quesadillas rock!!\nLove this place... both HB and LB...\nCheck it out........................................"
    ],
    "wbWLQoVTApttZxAZxslIuQ": [
        "We came here for a special date night on a Saturday night.  The service was above and beyond; even the manager came by multiple times to check on how the...",
        "We've eaten at Nardo 4 times since they've opened. The first time was after they had only been open about a month. The food has been excellent every time!...",
        "True Italian feel and taste .\nVery noticeable that Nardo service is top of mind as the staff is top notch .\nOutside patio has view of the pier and the..."
    ],
    "v8A-zi2EPMwyyGHryYuQzQ": [
        "Overall, this is a great place for a date! The service was 10/10, and ambiance was 10/10. However, the food was only 9/10, in my opinion, but that is not a...",
        "My husband and I went to have dinner 05/13/23 around 6pm. The service was horrible. There wasn't anyone at hostess desk. Many servers and staff walked by,...",
        "10/10 \n\nFood is fantastic. I loved the Baked Salmon and miso soup. The miso soup is a little pricey but the bowl is big! My friend loved the hash brown roll..."
    ],
    "DYhXBmEjdnAoDJwlQz9T6Q": [
        "My cousins reached out to grab dinner for OC Restaurant Week 2023 and I was reluctant to go since there have been times where the quality is compromised...",
        "We had Sunday Brunch here, which was good, but not the menu we were expecting. We were expecting more seafood and more options. Menu was small and...",
        "Great Serivce - Asia who seated us was was helpful as was our waiter Veincente.  Food was good, my lamb was too salty and the oysters were great.  The 3..."
    ],
    "BrEg6Vqcr_xMftW6y-iIOg": [
        "we live in Huntington Beach and are downtown almost every day.  We like to eat at this red because the food is good but the service needs help.  We attend...",
        "Once again I got the Taco (beef), Enchilada (carnitas w green sauce), Chili Relleno combo. It was fine but next time I think I'll switch back to the La...",
        "Awesome interior and vibes. We came here for a friend's birthday dinner + girls night out on a Saturday night so it was pretty busy. Food is priced..."
    ],
    "VbGD1SBNj3gfVISCBzmZnQ": [
        "I love Little Sister, so when I heard about LSXO, I was already in! I came here for one of my birthday dinners with my two favorite friends.  That's my...",
        "Didn't have a reservation but luckily some people cancelled. You have to walk into another restaurant to get to this one - it was a little hard to find. The...",
        "Food: 5/5\nService 5/5\nAmbiance: modern/vibey \n\nCame here for my birthday and decided to go to a high end restaurant to celebrate with my friends. I've got..."
    ],
    "Z0aogEeyM9iXI6lz-Wo_Fg": [
        "We LOVE Duke's! Our waiter, Jason, was stupendous and made us feel quite special.  It was the first outing with no in a wheelchair, and although it was...",
        "Dining at its best in Huntington Beach. Duke's restaurant is one of our favorite places to eat when we are at the beach. Fine dining Hawaiian style and a...",
        "The place is really nice overlooking the ocean!\nThe food was delicious and the drinks were good too!\nThe service was fantastic, forgot the gentleman's name..."
    ],
    "She8LwmCUNuLiAvuISK1Xg": [
        "When lifelong friends are visiting from the east Sandy's beach shack is one of our favorite breakfast meeting points. \n\nLocation location LOCATION... This...",
        "Disappointed is not enough to express my feelings!\n1st time trying this place. \nThe only reason we came here was because of their fantastic location by HB...",
        "This place is always really solid. The service is great and food quality is spot on. Some of the best clam chowder around. Was here on a Tuesday and they..."
    ],
    "mtn4uojv4aXT5-WfTKnxow": [
        "Very good food. Service good . Nice area for family and friends .  Excellent restaurant in Orange County",
        "Not too bad of a wait before getting called to the tables. Good space between other patrons. Food is great could use more flavor on specifically the spicy...",
        "Food was beyond delicious and service was great on top of it. Definitely on the list to revisit"
    ],
    "OMGfOSVtxXA9WQ-zWLZowA": [
        "So...I'm reluctant to write a review because THIS PLACE IS OFF THE CHARTS!!! And, I don't want it to get too crowded.  \n\nI LOVE their food SOOOO MUCH that I...",
        "I ordered the yellowtail sushi and the panang curry with chicken. The yellowtail was soft with the buttery flavor. It did have a slightly fishier taste than...",
        "All I can say is WOW, the service and the food are simply AMAZING!!!\n\nThe edamame is the BEST I have ever had and the cream cheese wontons were..."
    ],
    "1YgvpICKqq5wOHv0A5kJ8g": [
        "If you want to enjoy an artisanal burger with a stunning view of the shore, look no further. \n\nFood: The burgers are great! The prosciutto burger and the...",
        "Came here as this is where my partner and I went on our first date. It is still a beautiful view and we came around 5 PM on a Tuesday. It was not crowded at...",
        "So this is what a $10 side of fries looks like here? SMH  ‍ \nWow\n(And this is the cheapest thing on the menu.)"
    ],
    "SQ_afwypxd2Ay8sXMjkeFQ": [
        "This is a poolside bar and grill at the Hyatt in Huntington Beach. I really enjoyed everything I ordered from here. The peach passion cocktail was great and...",
        "Connected to the main pool in the Hyatt hotel. I got a mockito and shrimp & chicken tacos. They were delicious! Other family members got the quesadilla,...",
        "This is really just a poolside bar and grill. Wasn't expecting much. \n\nThe drinks were great. Big and flavorful. \n\nBut the big surprise was the blackened..."
    ],
    "mN9lehvfxiTl4kniZ9U2pA": [
        "Good service, good food, amazing amazing fries  \nMan, my first time in love with the sandwich everything fresh. \n10/10",
        "This sandwich was SO good and flavorful. Service was quick and super friendly; it feels like a local, beachy-meets-hipster spot in the best way possible. My...",
        "This was a great find for me. I passed by here all the time and kept saying I needed to stop here.  Well, I finally did, and what a find. \nFirst off, it's..."
    ],
    "f6__ZkORVNPvAsrXJcYjXw": [
        "Great food\nGreat service \nNice variety on the menu.\nPrices were on par for the food. \nAtmosphere was awesome. \n\nI'd go back!",
        "We went to brunch a couple of weekends ago.  Service was great, Food was terrible.  I posted a review here right after our Brunch.  I don't know how YELP...",
        "The low stars is for the food, I was so hyped about this place when coming to visit Huntington Beach, but the food just didn't live up to it. Service was..."
    ],
    "ElvZ-9U8y_LtJvVQ3oUibg": [
        "If you're looking for a truly authentic farm-to-table experience, I would highly recommend looking into a visit to heirloom \n\nThis charming restaurant is...",
        "We love this place for date night!  Unless your kids are well behaved, please leave them home!  Very nice people and Charlie is one of the best servers!...",
        "I can't believe I didn't know that Heirloom existed but it's easy to miss as it's located in an unassuming strip mall. When you walk inside you're..."
    ],
    "Ett7J1yE3CrPZ1kHppX2wQ": [
        "May 1: i've been to the Kauai location several times and always take a half chicken on my plane home to munch on and torture the other plane passengers with...",
        "I can't say enough good things about this place. I walked by this place and the vibes caught my attention along with the \"BBQ\" sign. I love BBQ so decided...",
        "Decor was fun, we were there on a Wednesday night just before closing and it was quite but the food was delicious. My daughter had the Po Boy. The pulled..."
    ],
    "4X7ID72PfWTIUqKfOIsDQQ": [
        "Good outdoor seating, decent food and drinks \n\nCame here with my $40 food voucher from pacific waters spa (see my review - also on Hyatt regency grounds)...",
        "I arrived to Pete's super hungry and very eager to eat everything. It was a matter of convenience that brought me to Pete's since I was staying at the...",
        "The food was delicious and honestly a bit less expensive than I thought it would be. My server Nathan was awesome. He was kind and attentive while easily..."
    ],
    "DzfPr0semf3YmRDkFa_fXA": [
        "I had a wonderful dining experience at Ini Ristorante!! I enjoyed the tasty dishes, calming and inviting ambiance, & their amazing customer service!\n\nOur...",
        "Decided to come here for brunch on a Sunday. Highly recommend a reservation or be prepared to wait . When I arrived , parking was packed and restaurant was...",
        "Visited again for a friend's bday and we tried the Soy Glazed Potatoes (Brunch Item) and the Spicy Miso Carbonara!\n\nWe loved the potatoes - sweet and salty...."
    ],
    "6wZDUNegV2Z4WURA2Qh-qw": [
        "I recently visited The Beach Hut and was disappointed with my experience. The food was lackluster and overpriced, with a limited menu that didn't offer much...",
        "The food here is very fresh and reliable. Ingredients really are very good, every time. Not sure of the \"why\" but service is often slow. Perhaps just the...",
        "After 37 years the city of Huntington Beach underhandedly decides to not renew there lease I called yo see what time they open on the Fourth of July I'm..."
    ],
    "1Vrdp08ANggeV9BBYZyeyw": [
        "This reminds me of my favorite bar at home. The bartenders are friendly locals who know their stuff. The whole time I was there folks would walk by and say...",
        "Not bad, but there are definitely better options. I wouldn't go back. \n\nOrdered oysters-just okay. \nKing Crab-was good, but not spectacular or worth the...",
        "The Ahi Tuna Sashimi appetizer was enough for my friend and I to share as a light meal, especially when we ordered a side of chips to go with it. Food and..."
    ],
    "K2byJge0H03UsI4SvUpuJA": [
        "This pizza is BOMB they just opened up again and it's not perfect but the food was so good and the girls sat were so nice !!!! and they have a full bar now...",
        "Yelp has done Sahara's Pizza a little dirty.\n\nI agree that this is not a gourmet pizza spot.. but who would expect gourmet pizza five steps from the sand in...",
        "Nice view but if your coming for the food don't. Takes forever and not very good, pizza is mediocre at best."
    ],
    "MFmYTmAsQl6aAfIXuJKKjg": [
        "Outstanding service by the whole crew but Sophia was by far the best!\nWe will definitely be back",
        "Wonderful spot for casual dinner and drinks! Sophia was so awesome to us and it's such a dog friendly place if you have a pupper!!",
        "Been here multiple times and have been surprised with the service . Outstanding food and great atmosphere. Sophia is such a friendly and caring soul. Great..."
    ],
    "rPtjhMAidLbgjzYAkc_0zw": [
        "We've been supporting this business from the beginning. We're locals and believe strongly in HB small business. \nThere was a short period of time when...",
        "There could have been the possibility of giving this establishment a 3 or 4, but I had some disappointments that couldn't be overlooked.\n\nFirst, the...",
        "Came for dinner on a Thursday night. Place was fairly empty at 6:30pm\n\nFood: \nAppetizers\ncheese curds were very tasty but thought portion was small. I'd..."
    ],
    "fktFWbil7gxfdjTp1FtUEw": [
        "Loved this place never took the time to write a review but had to. Loved the burgers juicy, tasty and great portion. \n\nFor appetizers we had the deviled...",
        "Well, this used to be out favorite burger place, but no longer. \n\nWe actually moved away from hb and used to talk about wishing it was closer to us. \nI...",
        "Favorite restaurant in Huntington. \n\nEverything I've ever tried has been so good. The veggie burger is made with a house made veg pattie... BOM. \n\nHad all..."
    ],
    "nqWSOXdUED7DEFK1p0vDwA": [
        "First time at the place. Was extremely impressed by their servers and how welcomed they made me feel. Jake and Carly were the best and made the experience...",
        "Well, I was very happy that my daughter knew about this place and took me over on a Tuesday evening. It was lively and energetic and had a lot of fun stuff...",
        "Came for brunch today excited to order and try their Dutch baby pancakes but was told they have not carried this item for over half a year despite having it..."
    ],
    "3qUgMKlIlpXQjhKyOcEqSA": [
        "Food: excellent\nWe got the seafood tower\nTomahawk and scallop \nCheese cake and cappuccino \nCocktail drink is strong and good\nBeautiful ocean view \nServers...",
        "This place is just okay, prices aren't crazy which is good and actually surprising for its location and aesthetic, but I wouldn't make an effort to...",
        "Lovely location. Amazing view of sunset over Huntington pier. \nYummy food such as meatball appetizers. \nWe had the meat lovers pizza as well. \nThe first..."
    ],
    "Qhdd6dylyo51f7LiNb1XfQ": [
        "Amazing! I wish I had the capability to try every single drink on the menu. Such a cool spot and the no phones idea is genius",
        "One of the funnest nights I've had in a long time. Other bars should take note: a no-phone mandate is exactly what people need to enjoy themselves.\nGreat...",
        "What an outstanding new speakeasy. Vibe is much different from most types. This one is bright and colorful, with such an upbeat feeling. I also love that..."
    ],
    "SO1Bn9OYnBx3mQiUnDf3RA": [
        "Great food.    Relatively simple choices, but good ingredients and great service.  \n\nSit at a sidewalk table and people watch while you have breakfast.",
        "Came here for a quick lunch mid week and we loved it! It's a tiny place but has a cute beachy vibe. For midweek it was pretty busy but the service was still...",
        "Food was very subpar but the service was good. \n\nCame here early on a Sunday morning. It was pretty cold so sat inside. The seating inside is pretty limited..."
    ],
    "829KDoMqT5MHVII4F7QdbA": [
        "Love it!! I love this place, its cute inside and the staff are so friendly and personable. They have a lovely array of drinks and I appreciate the vegan...",
        "bummer, i came for the potted lattes with the crushed oreos- sadly they don't serve that anymore. \n\nI got the lavender latte per usual, but it tasted very...",
        "I first stopped into this place before getting my hair done across the street. It's tiny and cozy with great outdoor seating in front (there is a comfy..."
    ],
    "6IDXE3rFWcsiuy0eYsEZzA": [
        "The service is amazing, so is the food. the food is so good, i don't go out to eat sushi that much but it's so good. Even though it is on main street and...",
        "Best rolls and sushi ever. Even the Asahi tastes better here! I recommend Sushi On Fire to anyone who wants to enjoy good sushi/rolls!",
        "First of all this does not come lightly but this is one of the  best sushi I've had. Even their miso soup is so delicious! Every roll I've ever had has been..."
    ],
    "O31OF8PIjOnLzaVcMZt63Q": [
        "I received a gift certificate to this restaurant from a good friend that lives in San Francisco!   She researched restaurants and chose this one for us!  We...",
        "I love this place. I felt so relaxed just walking in and absorbing the atmosphere and left even more relaxed...wine can do that.\n\nI arrived one afternoon to...",
        "Wow wow wow!!!!!! As a local food critic, self-proclaimed chef and food and wine pairing master  I was s impressed Brightwaters Wine Bar and Restaurant...."
    ],
    "gaOBPRXA01xOp7YsMa1iJA": [
        "It's was our son's birthday and he wanted to celebrate here since he's always wanted to try it. They have been rated one of the top ten pizzas in the OC...",
        "Great service!\nWe sat outside it was a bit chilly but they have heaters.\nWe ordered the Brussels sprouts and a sausage pizza.\nAbsolutely delicious!",
        "The pizza is among the best in OC. \nWe had the mushroom mascarpone and caramelized onions pizza and the honey and Gorgonzola one. Both were great. \nPrices a..."
    ],
    "I11OBtsJ2cXKIbiCEN9rZQ": [
        "First time at The Ria Pizzeria and it did not disappoint! I typically don't like deep dish but this pizza was cooked to perfection. Crust was crunchy but...",
        "This place is so good. I tried it based on the reviews and it blew me away. It was cooked to perfection and had the right ratio of dough, sauce and...",
        "This place is phenomenal. I was greeted by the owner who just had such a peaceful and genuine demeanor about him. He gave me some recommendations and we..."
    ],
    "BbXoCcgkVhHiBoABUKb9zg": [
        "Had a Wahoo taco, overcooked fish unfortunately, very dry. The shredded cabbage was plentiful but not dressed at all so surprising added to the 'dry' as...",
        "I always thought this was a fancy sit-down restaurant every time I would walk by, but was pleasantly surprised it wasn't.   Orders are placed at the counter...",
        "My favorite poke outside of Hawaii is Bear Flag Fish Company!  I would go out of my way to come here.\n\nI love that you can order by the pound here just like..."
    ],
    "vO1JtdKhSJ-KwfeeQNf7GA": [
        "No words can say how I loovve this restaurant. Five star\nDelicioso. Specially the Baja crisp taco",
        "I bought my place here in HB in the early 90s, and have gone to Las Barcas several times over the years, as my mother-in-law lives around the corner from...",
        "Good food\nClean. And always on time  fajita burrito our favorite and chips salsa$$$we always come back"
    ],
    "3s2xpbv6Qfqp6B4HYyLJQA": [
        "Cute place inside.  Nice friendly staff. \n\nGreat menu. Everything we ordered was so good.  Definitely be back.",
        "Love Eat Chow Newport Beach! The staff is great. Very personable but also professional. This is our go-to if we just don't wanna cook but want a good meal...",
        "Went in yesterday and although service was quick (not the usual case but we were one of the only tables in there) the server made a comment that just didn't..."
    ],
    "KiT9dQRo2m9Fegl9Y6vwvw": [
        "Lunch Time / Family friendly! \n\nCheck this place out for good burgers or ceviche HB, CA  \nSurf City USA",
        "Tanner's is absolute rubbish and nothing can top this overpriced box near the beach. \n\nI came here for a chat and after paying $26 for some skewers, I...",
        "Cute ambiance right along PCH.  Nice outdoor seating and cute indoor style.  \n\nWent here for Restaurant Week OC but by day 2, they were already out of their..."
    ],
    "RtNK04XsOmIGOYu9zgvwIg": [
        "Wow, this place is amazing!! Great delicious authentic Mexican food. I had brunch there with some friends. I got the chorizo and egg plate and shared their...",
        "Terrible service! The staff at the front seems to favor their acquaintances, providing unequal treatment to other guests. Despite waiting for over 45...",
        "This place is okay. My family loves it, but I'm neutral. The elote is good and some of the other appetizers, but there are plenty of other Mexican..."
    ],
    "wsDfelXvTBNPFzaQS7pBBQ": [
        "Summary: if I could give more than 5 stars, I would.\n\nFull review:\nI'm part Danish, but the times I've eaten Danish food have been when my grandparents were...",
        "Great atmosphere, friendly owners and staff! The food is amazing. Full of flavor and very tasty. My wife and I stopped by for dinner this past Friday. We...",
        "Food is great. Service is superb. Ambience is really family friendly. Overall experience was amazing. We visites for brunch but sure we will come back for..."
    ],
    "0PHc51z-e7vXfeyhRNSSNw": [
        "Food was excellent! This was our first time eating here and we will definitely be going back to try a few more things we saw on the menu.\nFood was fresh and...",
        "Great gourmet Mexican food. I have only been here for breakfast but everything I had was outstanding. I highly recommend the pozole.\n\nI will have to stop by...",
        "There are plenty of parking spaces. They have indoor and outdoor seating available. They provide chips and salsa, which were really good with a kick of..."
    ],
    "HXLiSkI1Yju6LP4ixj2Dvg": [
        "Stumbled upon this gem with my family. All of us ordered different meals and all enjoyed them beyond words. Lots of \"Mmm, you gotta try this.\" They sell...",
        "Delicious, fresh, fast, convenient. I love to cook, but I also love the luxury of letting someone else do the cooking. For me, that's what PorchBox is....",
        "I absolutely love the idea of picnic food!! This is a snall place meant for take out but there are some tables. \n\nThe flavors are hit and miss so make sure..."
    ],
    "57OzUeG9JfHOmllTNwICrg": [
        "Ordered lupes cali burrito combo. This did not disappoint. Neither did their bierra fries which is a meal or two in itself. I highly recommend Lupes.",
        "This is my first time coming here, Maria C was great help she helped me pick out what I wanted to eat she was super patient!, I ended up getting the...",
        "Amazing food. Had the ahi tuna and tuna tacos. Delicious!!\n\nAlso got the chicken quesadilla and a steak taco to go. \n\nThe menu is pretty extensive and I..."
    ],
    "a7FyzXrTkoqia7OntCPZhg": [
        "Excellent service. Robert was really helpful & attentive. The food here is healthy, nutritious and absolutely delicious. Desserts are great here too if you...",
        "Good service excellent area and nice hostess and worker will be definitely coming back!",
        "I usually go to the Urban Plates in La Jolla, but decided to try this location since it's closer to home and ever since I've tried their Osso Bucco (lamb..."
    ],
    "cZwkE7tvQqpji-Qzk_0nEg": [
        "Food has always been delicious! I am only giving 3 stars because today, for the 2nd time we have ordered to go, I sat there patiently waiting for our order....",
        "The birria here is awesome. I could eat this everyday if I could. Place is clean and staff is super friendly",
        "I had the Birria and Birria Quesataco... both were great, the quesataco was phenomenal. It had a little kick to it, was warm and delicious. \n\nYou don't get..."
    ],
    "kyjasU3tHDezSp215LOPdA": [
        "Food here is great! The steak tacos and fish and chips are my favorite. I was super impressed by the two woman that were serving. They were friendly and...",
        "Always great food and great service. The fish is fresh and the recipes are original and always prepared with care and presented nicely. The environment is...",
        "This is my favorite healthy option on DoorDash and I order weekly. My favorite thing is the ceviche but stopped ordering it for a few months bc there was..."
    ],
    "tKDFL5NjPWnX_AK3uj7INA": [
        "Every dish has been a joy, we love the chai tea.\nHowever, they haven't reopened since there may have been a kitchen fire...",
        "Unfortunately this restaurant has been closed for several months now, although on yelp it still appears to be in business.\nToo bad, because it was one of...",
        "One of my favorite restaurants! I go here often with co-workers because this is such a great place to eat at. The service is awesome and fast and the food..."
    ],
    "UCB4P39vPpYaqL0R_y_M-Q": [
        "This was my first time trying Peruvian food. My mom suggested this for her Mother's Day treat. Our waitress was very friendly and checked up on us. \n\nFood:...",
        "This Inka Mama's location in Aliso Viejo maintains the quality and the general look-and-feel of the local restaurant group. The saltado with beef was served...",
        "The restaurant has great natural lighting due to being on the end of the building.  Very inviting.  The staff there are also very friendly and warm.\n\nI was..."
    ],
    "ZdvokJ3t2AbS8AniMd_-sw": [
        "Food is UNREAL. Another slam dunk from laguna beach. I'm confused how everything on the menu is amazing when it's all so different.\n\nMy girlfriend had the...",
        "Great food and great service. Recommend you go before 9:30am on weekdays- short line (or no line!). \nLite French toast meal was perfect! Not Lite in...",
        "We love Plumeria. We've been there dozens of times over the last few years, despite having moved away. A family favorite is the White Lava pancake..."
    ],
    "x4ksFReioH1P_AO8MEZP5w": [
        "Since Meiji Seimen stopped serving the soba with duck and green onion, I've been craving for this dish.  Thankfully the SO found this place on yelp.  The...",
        "I can literally rave about this place for HOURS. The noodles are so chewy yet soft. The broth is literally so refreshing and the best quality of udon I've...",
        "A few times a year, I make trips to San Diego, either for work or for fun. Whenever I do, I try to find a restaurant between me and San Diego to try..."
    ],
    "rdhmzI7AG5dKdo7ZXCybug": [
        "Food is great .. get the lamb ribs .. and both sultanis .. to die for! \nDecore is awesome .. too bad they removed most of it\nBe patient with their service...",
        "Really great meat and portion sizes! This place would be a hit if only it were located somewhere more convenient. This gem is situated in Laguna Hills Mall...",
        "Simply THE best food ever!\nTry it... so delicious! \nGenerous portions....\nIncredible flavors...\nKind staff!"
    ],
    "zWj7Fds1io8RnFPqOdD72A": [
        "Look at the profile picture. Exactly how things come! This is a business operating as a catchy name with catchy pictures on Postmates. However, this place...",
        "Do Not Order from this establishment until they train their team better. Ruined my kids bday by underdelivering on the order. Nothing in the order is...",
        "Very great it tasted delicious the grilled cheese melted in my mouth it was very good"
    ],
    "wnthjdU1WRQ7iViMR3Nhiw": [
        "The cold, rainy, windy, snow that is too close, weather has been driving me on a ramen for lunch binge. i20 Ramen was part of that binge and I am glad it...",
        "I've been coming to this plaza area for years and I hope\nthis place stays for a long time. \n\nI came here on a Saturday for lunch with family. \n\nFood - We...",
        "Located in Aliso Viejo town center, it's pretty easily accessible. It's a small restaurant and seating is limited. However, when we went with a party of..."
    ],
    "LyrpBZv6PObXtVpku7AFLA": [
        "Came in on a Wednesday night around 7pm without a reservation and got a table very easily. Everyone was smiling and very friendly. The cocktail menu is a...",
        "This last evening is an example of when it's time to find a new place. \nI try to go once a week but the last two times I have gone there I have seen the...",
        "Fabulous food and excellent service!\nAshley was our server and she was great.\nWonderful times and an extensive menu."
    ],
    "Vp27qKc7hnN99yJVFYz9Rw": [
        "The food is consistently delicious! The service is excellent and the ambiance is quaint & cozy. The owner & staff do a great job! \n\nVery tasty...",
        "First time for our family.   Great food, service  and the bread too.   \n\nEnjoyed the Italian vintage sport memorabilia",
        "What a find... Thursdays:  ALL martinis $6! And their martinis are appreciatively good-&-strong! Wednesdays:  1/2 off wines and no corkage fees!\n\nLively..."
    ],
    "DvxfH1xaHtPFxcLswQsp1g": [
        "Just in from Washington DC, we needed a good meal, and Kizuna did an amaayyyyzing job of bringing us \"back to life\" after our 3000 mile journey  \nWe got the...",
        "Authentically Japanese. Meaning that the chefs, kitchen, and wait staff are all Japanese! \n\nFish was very fresh and prepared correctly/traditionally. \n\nI...",
        "I am so excited to review Sushi Kizuna in Aliso Viejo. \nThe restaurant is a tiny place with a sushi bar that \ncan sit eight to ten people at most. There are..."
    ],
    "W4t4WHQ7VNi_3BEHb8zK8w": [
        "I've come here a few times already for my lunch break since my workplace isn't too far from here.\n\nI've only ever ordered the carne asada burrito because...",
        "4.3 Yelp average also a tad low\n\n4.5 is correct\n\nAn authentic, no frills Mexican restaurant- 2 hours from Mexico\n\nTaco Bell - this ain't \n\nDelicious food,...",
        "Came here only because it's one of the very few mexican places that is open after 10pm. I ordered their asada burrito and a side of fries. I love when..."
    ],
    "FR8bzCdbMlm5ud7KJKJ0FQ": [
        "They let you pick your fresh veggies and meat and grill it all for you in front of your face. They also have a large variety of other food, including...",
        "Food was really good! I did enjoy the chow mein and the mongolian grill. The desserts are tasty and sweet, not like the typical buffet. The service from the...",
        "It looks very clean and servers are\nvery nice!\nPresentations of the Foods are great.\nIf I could tell some, customers need to go get drink at the soda..."
    ],
    "t5Fl8raVRLb77iwYQEWzCg": [
        "One of the best meals I've had in a long time! Make sure to order the Banh Mi and the Bún Chả Hà Nội\n\nPlus, the prices are very reasonable for such high...",
        "Came here on a Sunday morning for Mothers Day. There was a queue and a short wait before we were seated. The staff were friendly, attentive and polite....",
        "Very unorganized, after waiting for 45 minutes and we were next inline then the staff seat someone else out of the waiting list just because they showed the..."
    ],
    "M8hB9MB1GDHoAiZhYEL8fw": [
        "these topping is really good and amazing =))) i like there everything in there. i love those service cause they nice and friendly  l love this place so much",
        "Trà sữa full toppings really good \nGood service \nGood ambiance for hangout... \nOnly new place has trà sữa full toppings \nLike Vietnam that nowhere in cali...",
        "I've seen many Unu Cafe's ads popped up on my social media and I lived close by so I gave it a try during the weekend. The store is located in a busy..."
    ],
    "wDOaStGMm7sfalmJaa9SLQ": [
        "I was a big fan of the tonkotsu ramen but the most recent visit changed my mind. Maybe there's a chief change but the tonkotsu ramen has less stuff and is...",
        "Favorites: \n- Hot Dish: Hamachi Collar\n- Skewers/Yakitori: Chicken Skin & Pork Jowl\n- Cold Dish: Temaki Set\n- Sauce: Yuzu Glaze\n\nDuring my visit with the...",
        "We ordered a bunch dishes: skewers, takoyaki, udon, tom yum ramen. We liked all of our dishes but we'd recommend the tom yum ramen for sure. The hand rolls..."
    ],
    "GPG_gFLvgtjt-4hKS2g_UA": [
        "This place is so delicious and the staff are always so nice! Our daughter had been going to the ballet school next door so we decided to stop by after for...",
        "Don't sleep on this place.  Tucked away in a hidden part of Bella Terra (behind a water fountain), is this cute cafe with incredible food and drinks.\n\nA few...",
        "Our experience here was fantastic!\nDefinitely an Instagram worthy spot and the food was amazing!\nI highly recommend this place for brunch with beautiful..."
    ],
    "Y7ne_c7IJ-iwekUwI4ffrw": [
        "First time at Bollini's and definitely won't be our last!\nMy family and I stopped in for dinner tonight and were immediately greeted by friendly staff who...",
        "So good!  Things to remember:\n\n1.  This place is small. You will likely have to wait outside when it's busy. No bar area. \n\n2.  Serving sizes are big!...",
        "First, this place doesn't take reservations, so if you get there within their first hour of opening, you should be okay to find a table. Otherwise expect a..."
    ],
    "wfbK2yJ9hh8v4NlDCUb0eg": [
        "Great food and service highly recommend the passion fruit mule and filet minion tacos.",
        "Emily gave us excellent service! The food, atmosphere and drinks are great. I always get the chopped salad",
        "Came here for date night and the service and food were great. Emily our server was very attentive. Shout out to the kitchen. Tomatillo árbol was on point...."
    ],
    "db2Rqwfiti4NPCocqXJADw": [
        "This place was our first time trying Lao food and that pork sausage bought us back for a second time. Actually, everything here is great - but man that...",
        "Went back for their one year anniversary and was so excited to see their new expanded menu! We loved everything we got and the presentation was amazing! \n\nI...",
        "Thanks to Issue#19 Amazing Asian Eats of the Local Yelp OC, that's how I found/heard of Nok's Kitchen. We browsed the menu and pics on Yelp and were looking..."
    ],
    "1AZgjTOLUDboVJQJ7SCCiQ": [
        "I love the pho and other dishes here. My favorite pho spot out of many in Garden Grove area. Usually get the beef pho but sometimes get chicken mien ga.",
        "Not sure why the reviews are so low. I went this past weekend and the service and food was delicious. Also try their gelato ice cream it was amazing. Cant...",
        "This place is so good! I've had many pho restaurants around OC and this new place is one of them. The broth is clean and it tastes like Phoholic, I love the..."
    ],
    "o3V0deE7kAh72-IGvHW9ag": [
        "This gem of a spot, tucked into the heart of OC, is easily one of my favorite dining experiences I've ever had -- and I'm not even exaggerating. They have a...",
        "the food here was magificent. The elote with bone marrow was amazing and the octopus was cooked perfectly. The only thing i might dock them on at all was...",
        "The service is abhorrent.  First the hostess says booths are only for more than two people.  Then I see them sitting just couples over and over again at the..."
    ],
    "ia09aCVFnDFwoRweRwhcLQ": [
        "Bunz is the best Burger in town and the employees are always friendly they also have real good shakes   I recommend if u haven't tried Bunz to do so your...",
        "Quality is key and the quality remains top of the bar.\nConfused this for another spot tried it and realized I've been here before lol.\nTried a few things...",
        "Food is still delicious but friendly service has gone down. They have snuck in a 3% inflation charge in your purchase. You won't know unless you read your..."
    ],
    "5DTm4C8g5NaFzSWQ_2FrjQ": [
        "Great food, and atmosphere. Ashley was very professional and friendly. \nI ordered Brussels sprouts, Eureka salad, and French dip, and it was great.\nThank...",
        "Great atmosphere and selection of alcohol.  It was are first time there and the service was great.  We ordered French Dip and the steak salad. I was very...",
        "Good happy hour - good beer selection and craft cocktails \n\nI would like to see a wider food selection for happy hour - more smaller dishes to complement..."
    ],
    "9tOqXZs5-XyRI0DIytZZJg": [
        "Best new spot in town, the food was amazing, everything we ordered was yummy, especially the house lobster  \nReally awesome service, Nathan was amazing...",
        "Service was super nice, relatively fast esp seeing how our hostess was also the waitress and the busser. \n\nFood was pretty good. We ordered a lot off the...",
        "Came here for my friend's birthday and I must say that I was pretty impressed by the overall experience. It's a low key spot that's hard to find but the..."
    ],
    "KRJ_fBzpTCy8HkOR6rgd9Q": [
        "We love the following items...\n\nThe Fromage savory crepe substitute sweet batter instead of buckwheat batter, and substitute jack cheese instead of Brie. It...",
        "Went on Saturday. Very busy.\n\nHad Belgium waffle and French Benedict.\n\nFrench Benedict had this cheese that was bit on sour side but it was...",
        "Ambiance: 7/10\nThe shop is located in the old world village where everything is themed after Old German architecture. The surrounding area really makes you..."
    ],
    "kBzS17SG28-FfJVsQRtyXQ": [
        "Do yourself a favor and visit the Dog Haus!!!!\n\nI got Buffalo wings and they were amazing! Great size, very juicy, lots of chicken, yummy different taste!",
        "I have to be honest and tell you that I wasn't expecting much from this place.  I looked it up and I love hot dogs and sausages so I just thought, okay,...",
        "Came here on a Tuesday to grab a meal before watching a movie at the nearby theater \n\nI ordered the cheeseburger while my husband ordered the Old Town hot..."
    ],
    "qAxrJXBEkAlGzDdAJoVZ7g": [
        "This little place in Bella Terra has so much goodness!  the food is awesome and served super fast!  Team members are on top of making sure you have great...",
        "Interior represents Huntington Beach decorated with surfboards and a beautiful mural. \n\nThe first time I had silverlake was during the pandemic, when all...",
        "Ridiculous. Do not eat here. \nWorst service in the world! They refuse to take to-go orders over the phone so you have to go in person to wait in their tiny..."
    ],
    "yMY5W6x8RhBPrfCBe8JcUA": [
        "The food here was literally bussin! The shakes are bomb and the Mac and cheese was so delicious! Our servers were happy and peppy and made the experience...",
        "Maybe I'm just an easy person to please, but the food here was so delicious. I didn't leave a review the first time but I came back and everything was just...",
        "Nice ambiance with bar with good cudtomer service. Ordered nachos and the house Stack'n Blue Burger. The nachos which I took a photo of was nicely layered..."
    ],
    "ZkU0fHAi5fDHyBr-8ZqP5g": [
        "Calling all Yelp members! The Recess Room is one of the hidden gems of Huntington Beach and they will be closing soon. If you haven't tried this place, I...",
        "We had high hopes for this place ever since we saw it while at Kappo Honda.  It was the worst service this year. From the bartender not making our drinks...",
        "What the hell happened to this place?! This place used to be poppin'! My friends and I used to frequent this place for great drinks and food, superb service..."
    ],
    "_nTE9qR2-_bH7b3bbcnyhw": [
        "TIP:\nLocation- on the side of My Thuan Market. Can't get through if you enter in from the supermarket bc they blocked it from the inside. There's no seating...",
        "We ordered so much I can't list them off. We received our order and opened it right away to eat it hot buuuuut to our disappointment everything was room...",
        "If you're looking for authentic dim sum in Orange County, The Dim Sum Co. inside My Thuan Supermarket is the place to go. This restaurant has been serving..."
    ],
    "YT0Ht_-wprjcAoGP1q9nGw": [
        "This is one of the Turkish restaurant we always go when we go to the area.\n\nThe cheese roll are very delicious and great appetizers \n\nIf you have a party of...",
        "Tried this place out recently because of the great reviews that I saw on Yelp. Was not disappointed at all!\n\nLocated near the Fountain Valley Costco, this...",
        "like traveling to turkey for the afternoon\nthe food was on point\nvery casual\nspot. just good of your craving a little Turkish chretchi"
    ],
    "1jTbwgCyFDR51vpNoUrGIg": [
        "People say if the salsa is good then you can expect your meal to be good and this hasn't never been more accurate! After devouring the chips ans salsa, we...",
        "Honestly some of the best Mexican food I've ever had, and I'm very picky! Great atmosphere with live music, perfect Friday night out. Eduardo was an amazing...",
        "Brandon is the best waiter ever!!!! We had elote, queso fundido and tacos!! My mango mojito was a great suggestion from him!!"
    ],
    "tnoEqB-Rbrrb_AJKHb80xg": [
        "It was my first time dining out at Nova last Friday. I have only heard great things about the place from my friends and decided to try it out. My friend and...",
        "Very friendly staff but unfortunately the food was mediocre. We ordered Kung Pow Chicken, which was way too salty, Fried Calamari was good, Spicy Tuna...",
        "I recently had the opportunity to dine in at Nova Kitchen and Bar with my wife for our fifth year anniversary. I had trouble picking a restaurant and had..."
    ],
    "pFBm-PqFIKSBhcaOcC3vLw": [
        "This Thai/crawfish fusion is new. This used to be a late night pho but then it was closed down and crispy pork gang took it over. So parking can be hectic...",
        "This was one of the only spots open late at night so I thought I'd give it a shot. \n\nThere's mainly Thai cuisine available and I ordered the fried rice with...",
        "After a late night of basketball, I visited Crispy Pork Gang. The star of the show, as the name suggests, is the drunken noodle. It was cooked with a moist..."
    ],
    "PMtQzrRL8wzuYC_ZMwm-6g": [
        "I so wish you had one in the bay area!!  Youngest brought us here to try their hand rolls and we got lucky and managed to get reservations and run over!!...",
        "I must say that I am impressed. My friend and I have been to a few different hand roll spots and ROL by far is our favorite. \n\nWe love the variety of...",
        "We arrived just before the dinner rush and asked for a table. Taylor was able to seat us right away and gave us some recommendations after I mentioned that..."
    ],
    "Jl5yVff6VbsFeKbfClfqxg": [
        "Thanks to ghost pizza for an amazing experience food and customer service is great! I will always come back and be a daily customer.",
        "Ghost pizza Has the best Pizza In Orange County and the crust and everything on the pizza is absolutely amazing !! Great customer Service and The vibe with...",
        "1. The pizza had nice crispy edges, and it tasted delicious!\n2. The spot has fun casual vibes with lots of seating!\n3. The staff were friendly and..."
    ],
    "BbjxqOfxeWeokJ2Z6XVeEw": [
        "The service was great but the food was ok . Our server was Timmy, he was fast , friendly and a good sense of humor",
        "We absolutely love dining at this restaurant, and we are consistently impressed with the exceptional customer service, delicious food, and inviting...",
        "All l can say is wow . \n\nI cannot believe  that I have been driving to Los Angeles for something this good sitting in 10 minutes away. \n\nThere wasn't a..."
    ],
    "LX6C29U42lTTD4ElyVZEXA": [
        "I loved their hủ tiếu đặc biệt.\nThe one with the small lobster was fun to eat.\nTasted really good, the portion was fairly large and fulfilling, almost could...",
        "AVOID! AVOID! This place is the worst!\nIf I could provide a negative star that's what it deserves.\n1) no one understands English\n2) utensils are dirty, like...",
        "Big portion, lots of toppings and fair price. Solid place for hu tieu. \n\nI love ordering togo because it always comes with a cup filled to the brim of the..."
    ],
    "yF4ZN5xDIo_RnskbID3b_A": [
        "Cedrick and Abe were great! Definitely brought the vibe. Food was amazing with a lot more to try so will definitely be back for some more!",
        "Everything I ate was amazing here. Makes me want to come back to try more items. It might make sense to come with a group of 4 so we can get more items to...",
        "Food wasn't anything special. Not much to comment about. \n\nThe service needs improvement. We got sat right next to the manager or owner which meant we were..."
    ],
    "3xlytJi2VfwfBPfVpLjw2A": [
        "It was my first time visiting this past Saturday! AND WOW! After hearing my mom rave about this place for months, yes months, I decided to come and try it....",
        "Green and red chilaquiles \n\nRed chilaquiles made with quajillo which makes them not so spicy personally its a big portion for me \n\nGreen chilaquiles were...",
        "My sisters and I were looking for a spot to brunch on Mothers Day, but everything had crazy wait times. We unexpectedly decided to drive to this location..."
    ],
    "bXfsKNMY910FioFGRtA05g": [
        "The ambience, food and staff will make your experience delightful! This review is long overdue, so I'm unclear if these items are still on the menu, but my...",
        "OMG!!!\n\nVery nice place.  Little bit LOUD for the weekend.  Take a while, so if you're in a hurry\nThis is not place.    Beside that everything was...",
        "This is my 2nd time here, I can't remember what I ordered the 1st time but the fact that I haven't been back probably tells me it was not spectacular...."
    ],
    "JVz1Cuv9PF_ITRB5dBO6iA": [
        "Carlos is the hostess with the mostest! \nCame here on Valentine's Day \n\nJuan was our server and he was great. Amazing customer service\n\nOne pitcher = 5-6...",
        "I was looking for some yummy food on Cinco de Mayo. I always associate chips and salsa and margaritas with the 5th of May. Well, it might be a...",
        "Tried this place for the 3rd or 4th time. Food is okay. Bad service this time around. Ordered a Morenas mezcal margarita for $21, to my surprise this comes..."
    ],
    "1Qn2KFMqRU213CidK1-wzw": [
        "Arguably my favorite Thai place in Huntington Beach. There are times when the takeout waiting times can be a while but that's because everything is made to...",
        "This place is quite small yet cozy. The gentlemen who took our takeout order was very kind. \n\nBoth Pad See Ew and Pad Ki Mao ($13.00) were light in flavor...",
        "Street Thai Cafe is a hidden gem of a restaurant tucked away in a strip mall in Huntington. Despite its unassuming location, the food at Street Thai Cafe is..."
    ],
    "o_5L4Hbe9E_8u3hI6FB-EA": [
        "We had a bit of a wait but the food made it worth the while! It was a beautiful day so we sat outside.\nWe had the spicy pork rice bowl, stir-fried spicy...",
        "Tasty Korean food in Huntington Beach! Just be prepared to WAIT for it or call it in. It's pricey, but most places are nowadays. \n\nThe ambiance is clean and...",
        "It's how my parents would cook for me. If they knew how to cook. I scraped the bottom of my bowl and instantly wished these people were my parents. \n\nThis..."
    ],
    "bxbaB9_p_VH_RqzHPlOBcA": [
        "It's been quite a while since I've eaten at a Lazy Dog. \nI was out with my daughter and she suggested it so we tried it out.\n\nThey had happy hour still when...",
        "I always come to lazy dog when I'm in Huntington Beach, and I also have a lazy dog by my house, is the best place to go eat when you have pets! \n\nI love the...",
        "Phew! Didn't realize I had written a novel here--apologies! XD\n\nOkay--let's start out with what I didn't like. I had been looking for any place with good..."
    ],
    "JkGXRW30CiIv6BNiCN7STg": [
        "Been wanting to try an omakase \nmeal.  What better way to celebrate the wife's birthday.  Checked my peeps recommendations and found Fisherman's Table....",
        "Wow what a gem. We had wonderful service and wonderful food. But I think my favorite part of the experience was walking in and being hit with that fresh...",
        "Definitely not what I pictured. Lunch vibe good but not for dinner. \n\nI had the omakase and felt they were practically slivers of sashimi. Didn't taste..."
    ],
    "RRDpW0s7WmsIGRivD-YPPA": [
        "This spot right here is a goodie. And I have been missing out this whole time in good eats located in Bella Terra. I really need to stop hitting up the same...",
        "I'm emotionally attached to this location.  This has always been my \"special treat\" restaurant throughout the past 10 years we have lived in this community....",
        "First time here with my boyfriend and his mom for Mother's Day. We had a reservation and were sat right away. The patio seating was nice as it was a nice..."
    ],
    "lyj6qjWL4xX4GSH_ssicOw": [
        "Me and my husband have bin customers here since we where children now we take our baby for one the customer service is so good very friendly and nice and...",
        "Super delicious Chinese food for a good price. I got the 3 item combo with fried rice, chow mien, BBQ Pork, Orange Chicken, and mushroom chicken. 1 box...",
        "I wanted so much to live this place. And yes, it's a decent value. But, while they pile heaps of food into your container for a meal that can last 2 or 3..."
    ],
    "8oRP81DNGbA9wkdw4QvIIg": [
        "Amazing burger, friendly staff and one of the best shakes i have had at a burger joint. \n\nHighly recommend the bird nest it is a monster of a burger which...",
        "The burgers here are pretty good (they definitely feel like they've gotten greasier over the years) and the workers are really nice ! \n\nThe lot can get...",
        "First time.. and won't be the last!  Why have we never eaten here before, I don't know... all I have to say is WOW, The toast on that bun is AMAZING!  \nhad..."
    ],
    "vxCi1Bkd3bXV0s7SL-u_Gg": [
        "Came here on a whim. And was pleasantly surprised and the quality of the shabu. Delicious! Absolutely need to come try this place. Sometimes all u can eat...",
        "I love this place! This became my go to shabu when I got pregnant last year. For some reason all I wanted to eat was shabu during my pregnancy, and since...",
        "The food is delicious. We love it here and the stove top counters are like magic! The servers are very sweet. We drove an hour out of our way to eat here..."
    ],
    "bwz_xRxTQFDWFeN73jBPzQ": [
        "Hủ tiếu nam vang Pnong Penh rất ngon, nước ngọt thanh như ở nhà nấu, mình đã uống nước soup nhiều mà không bị cảm giác dị ứng bột ngọt .",
        "Excellence foods, drinks, and services. They add on night menu for sea food and snacks, very yummy.",
        "Wow this place is so good! I drive by this plaza every week, but just happened to stop by this time. #1 and #2, we got both each with rice noodles and the..."
    ],
    "V9v_TlJnIzIF61Ad973ojA": [
        "I recently visited here with my 2 kids.I have to say, I was blown away by the quality and freshness of the sushi! Every bite was a burst of flavor, and I...",
        "I recently visited đại sushi and was blown away by the overall experience from start to finish the service was exceptional the staff was friendly attentive...",
        "Bright and welcoming atmosphere. Very friendly service that greet you on the way in. The sushi tasted very fresh, especially the salmon and the tuna. A..."
    ],
    "vAzVWlsBPJx4nDNJb3cVEw": [
        "Absolutely my favorite Indian food in Huntington Beach !! I tried it back in January by placing an order on the phone and they accepted my coupon code I...",
        "Indian food definitely has bold and distinct flavors and could appeal to many. As a result I feel that it's pretty noticeable if done poorly. This place did...",
        "The food here is always excellent and the service very welcoming. Our favorite dishes are the Lamb Kabab, Rack of Lamb, the Garlic Naan Bread, the Vegetable..."
    ],
    "oiTvoPs5Nu4bv4Oln5O2mQ": [
        "Came here on a Sunday Afternoon. It was in between lunch and dinner so the restaurant was not crowded when we arrived but started filling up when we...",
        "I think people are blinded or distracted by their relatively lower price points.\n\nThe hot pot broth was bland, but super sweet. My mom said it tasted like...",
        "Fast service - English is not their first language so be patient! \n\nThis place is like pho hotpot. It comes with a large plate of a variety of meats and..."
    ]
}